[
	{
		"slug": "butterscotch-banana-bread-oatmeal-bites",
		"title": "Butterscotch Banana Bread Oatmeal Bites",
		"type": "desserts",
		"about": "Melanie found this recipe on her favorite blog - www.pbfingers.com. It's a nice healthy take on dessert. Perfect for kids or adults.",
		"ingredients": [
			"2 very ripe bananas, mashed",
			"1 cup oats",
			"1/4 cup butterscotch chips",
			"1/3 cup finely crushed walnuts",
			"1/3 cup shredded coconut"
		],
		"instructions": "Preheat oven to 350 degrees. Combine all ingredients together and thoroughly stir until everything is combined. ##Shape dough into small balls and place on a cookie sheet lined with parchment paper. The dough will be very moist and sticky, but it should hold its shape when formed into balls. ##Cook 15-18 minutes. Allow bites to cool and enjoy!"
	},
	{
		"slug": "brendas-chocolate-mint-cookies",
		"title": "Brenda's Chocolate Mint Cookies",
		"type": "desserts",
		"about": "Brenda has been making these cookies for years and they've always been my favorite. The texture of the mint that has melted into the chocolate cookie is amazing. If you like chocolate mint you have to try these.",
		"ingredients": [
			"3/4 cup butter or margarine",
			"1 1/2 cups firmly packed dark brown sugar",
			"2 Tbls. water",
			"2 cups (12 oz.) semisweet chocolate pieces",
			"2 eggs",
			"2 1/2 cups all-purpose flour",
			"1 1/4 tsp. baking soda",
			"1/2 tsp. salt",
			"Andes mints  (about 1 Ib.)",
			"Chocolate sprinkles (optional)"
		],
		"instructions": "In a large heavy saucepan over low heat, cook butter or margarine, sugar and water until butter or margarine is molted. Add chocolate pieces and stir until partially melted. ##Remove from heat and continue to stir until chocolate is completely melted. Pour into large mixer bowl and let stand about 10 minutes to cool slightly, with mixer at high speed, beat in eggs one at a time. Reduce speed to low and add dry ingredients, beating just until blended. ##Chill dough about 1 hour for easier handling. ##Preheat oven to 350°F. Line 2 cookie sheet with foil. ##Roll teaspoonfuls of dough into balls; place about 2 inches apart on cookie sheets. ##Bake 12 to 13 minutes - no longer (they will look undone, but will crisp as they cool). Remove from oven and immediately place mint on each hot cookie. ##Allow To soften, then swirl mint over cookie. If desired, decorate with sprinkles. Remove from cookie sheets and cool completely. Makes 80",
		"img": "https://pellegrinipage.com/family-recipes/images/Brenda6.jpg"
	},
	{
		"slug": "brendas-peanut-butter-kiss-cookies",
		"title": "Brenda's Peanut Butter Kiss Cookies",
		"type": "desserts",
		"about": "This is another one of Brenda's classics. It's hard to go wrong with chocolate kisses over peanut butter cookies. Enjoy.",
		"ingredients": [
			"1 - 18 oz Jar Peanut Butter (Jiff)",
			"1 1/4 Cup Sugar",
			"2 eggs",
			"48 Chocolate Kisses (9 oz bag)"
		],
		"instructions": "Mix all ingredients thoroughly in a medium size bowl. (Dough will be slightly sticky). With floured hands roll into 1 ¼ inch balls. ##Place on ungreased cookie sheet. Bake at 350 for 12 to 14 minutes until cookies look dry with tops cracked. ##Remove from oven immediately press a kiss in center of each cookie. Cool on cookie sheet for 1 to 2 minutes then remove.",
		"img": "https://pellegrinipage.com/family-recipes/images/Brenda6.jpg"
	},
	{
		"slug": "brendas-peanut-butter-cake",
		"title": "Brenda's Peanut Butter Cake",
		"type": "desserts",
		"about": "This is a cake that Aunt Brenda first made for Jim's dad back in 1986. He loved it and the recipe has stuck around ever since.",
		"ingredients": [
			"2 1/2 cups of Nestle Peanut Butter morsels",
			"2 cups flour",
			"1 tsp. baking soda",
			"1/2 tsp. baking powder",
			"1/4 tsp. salt",
			"1/2 cup butter, softened",
			"1 1/4 cup sugar",
			"2 eggs",
			"1 1/2 cup milk",
			"3/4 cup toasted coconut",
			"8oz cream cheese, softened",
			"1 tsp vanilla extract",
			"1/8 tsp salt",
			"3 cups powdered sugar",
			"2 tablespoons milk"
		],
		"instructions": "Preheat oven to 350 degrees. Melt 1.5 cups of peanut butter morsels over hot (not boiling) water, and stir until smooth. Set aside. In a small bowl, combine flour, baking soda, baking powder, and 1/4 tsp. salt. ##In a large bowl, combine butter and sugar, then beat until creamy. Blend in the melted morsels, then beat in eggs and vanilla extract. -Alternately blend in flour and milk. ##Pour into 2 greased and floured 8 inch round cake pans. Bake 35 - 40 minutes, until crust is golden brown. ##Let cool for 10 minutes, remove from cake pan, then let cool completely. Fill layers and frost side and top of cake with peanut butter cream frosting (directions below). ##Garnish with coconut if desired. ##To make the peanut butter cream frosting, melt one cup of peanut butter morsels over hot (not boiling) water, and stir until smooth. ##In a large bowl, combine melted morsels, cream cheese, vanilla extract, and 1/8 tsp. salt. Beat well, then add powdered sugar alternately with milk until mixture is of spreading consistency."
	},
	{
		"slug": "avas-apple-crisp",
		"title": "Ava's Apple Crisp",
		"type": "desserts",
		"about": "This is the dessert Jessica made on Thanksgiving night, 2011. She ended up going into labor that night and the next day our sweet Ava was born. Its a great dessert that will always have sentimental value for us.",
		"ingredients": [
			"1 cup all-purpose flour",
			"1/2 cup light brown sugar",
			"About 1 cup white sugar, separated",
			"1 tsp ground cinnamon, separated",
			"1/4 tsp ground nutmeg",
			"1 pinch salt",
			"1/2 cup butter (one stick), cut into pieces",
			"1 cup chopped walnuts",
			"1 tablespoon cornstarch",
			"1/2 tsp ground ginger",
			"6 cups apples cored, chopped (peeled if desired)",
			"2 tablespoons lemon juice"
		],
		"instructions": "Mix flour, brown sugar, 1/2 cup of white sugar, 1/2 teaspoon cinnamon, nutmeg, and salt together in a bowl. Combine butter in with the mixture using a fork or your fingers until coarse crumbs form. Stir in walnuts and set aside. Whisk together 1/3 cup sugar, cornstarch, ginger, and ½ teaspoon cinnamon. ##Place the apples in the bottom of the slow cooker, stir in the mixture from earlier (cornstarch mixture); toss with lemon juice. Sprinkle the walnut crumb topping (step 1 mixture) over the top. ##Cover and cook on HIGH for 2 hours or LOW for 4 hours, until apples are tender. ##After cooking time is complete, uncover the slow cooker to allow the topping to harden for about an hour. We serve this dish with vanilla ice cream!"
	},
	{
		"slug": "chocolate-lava-cake",
		"title": "Chocolate Lava Cake",
		"type": "desserts",
		"about": "This is a recipe we've been holding onto for some time now. It looks like a perfect holiday dish so we're going to have to make it soon.",
		"ingredients": [
			"1 package devils food cake mix",
			"3 eggs",
			"1/3 cup vegetable oil",
			"1 2/3 cups water",
			"1 package Chocolate Flavor Instant Pudding Mix",
			"2 cups cold milk",
			"1 bag (12 oz.) semi-sweet chocolate chips"
		],
		"instructions": "Prepare cake mix into batter using eggs, oil, and water. Pour into crock-pot. ##Prepare Jell-O Instant Chocolate Pudding Mix using milk. Pour this over cake mix in crock-pot. ##Sprinkle chocolate chips all over the top of the batter. Cook in crock-pot on high setting for 2 1/2 to 3 hours until cake is moist but not jiggle, and little volcanoes of spitting chocolate appear on top. ##Serve with ice cream, whipped topping, or on its own."
	},
	{
		"slug": "heathers-crunchy-carmel-apple-pie",
		"title": "Heather's Crunchy Carmel Apple Pie",
		"type": "desserts",
		"about": "This recipe came from Jessica's cousin Heather. Apple pie is one of my all-time favs so I can't wait to try this.",
		"ingredients": [
			"1 pastry crust for a deep dish 9 inch pie",
			"1/2 cup sugar",
			"3 Tbsp. all-purpose flour",
			"1 tsp. ground cinnamon",
			"1/8 tsp. salt",
			"6 cups thinly sliced, peeled apples (Golden delicious and fuji apples are recommended)",
			"1 recipe crumb topping (below)",
			"1/2 cup chopped pecans",
			"1/4 cup caramel topping",
			"Crumb Topping:",
			"1 cup packed brown sugar",
			"1/2 cup all-purpose flour",
			"1/2 cup quick cooking rolled oats",
			"1/2 cup butter"
		],
		"instructions": "Start by preparing the crumb topping. * Stir together brown sugar, flour and rolled oats. Cut in ½ cup butter until topping is like course crumbs. Set aside. ##In a large mixing bowl, stir together flour, sugar, cinnamon and salt. Add apple slices and gently toss until coated. ##Transfer apple mixture into the pie shell. Sprinkle crumb topping over apple mixture. Place pie on a cookie sheet to catch drippings. ##Cover edges with aluminum foil. Bake in a preheated 375 oven for 25 minutes, then remove foil and put back in for another 25-30 minutes w/out foil. ##Remove from oven. Sprinkle pie with chopped pecans and then drizzle with caramel on top. Cool on a wire rack and enjoy warm."
	},
	{
		"slug": "festive-fudge",
		"title": "Festive Fudge",
		"type": "desserts",
		"about": "This recipe came from Uncle Jim and Aunt Brenda. Fudge was always my Dad's favorite.",
		"ingredients": [
			"3 cups (18 oz) semi-sweet chocolate chips",
			"1 (14 oz) can sweetened condensed milk (NOT evaporated milk)",
			"Dash of salt",
			"0.5 - 1 cup chopped nuts (optional)",
			"1.5 tsp vanilla extract"
		],
		"instructions": "In a heavy saucepan melt chocolate chips with condensed milk and salt over low heat. ##Remove from heat, stir in nuts (optional), and vanilla. Spread evenly into wax paper line 8 or 9 inch square pan. ##Chill for 2 hours, or until firm. Turn fudge onto cutting board; peel off paper and cut into squares. Store leftovers covered in refrigerator."
	},
	{
		"slug": "sugar-crusted-meltaways",
		"title": "Sugar-Crusted Meltaways",
		"type": "desserts",
		"about": "This is one of Uncle Jim and Aunt Brenda's favorite dessert recipes.",
		"ingredients": [
			"1 tbsp grated orange peel",
			"1/4 cup orange juice",
			"1/4 cup sugar",
			"1/8 tsp salt",
			"3/4 cup margarine or butter, softened",
			"1 tbsp water",
			"1 tsp vanilla extract",
			"1 3/4 cups all purpose flour",
			"1 package (6oz or 1 cup) semi-sweet chocolate chips",
			"1 cup finely chopped nuts",
			"Sugar"
		],
		"instructions": "In a small bowl, combine orange peel and orange juice; set aside. ##In a large bowl, cream 1/4 cup sugar, salt, butter (or margarine), water, and vanilla. ##Lightly spoon flour into measuring cup; level off. Stir in flour, chocolate chips, and nuts; mix well. ##Shape dough into 1 inch balls. Place 2 inches apart on ungreased cookie sheet. ##Bake in a preheated 325 degree oven for 15-20 minutes, or until firm to touch. ##Remove from cookie sheets; cool completely. ##Strain orange juice mixture; dip cookies in orange juice, roll in sugar. ##Allow to dry to form sugar shell. Note: Self-rising flour is not recommended."
	},
	{
		"slug": "brendas-boiled-chocolate-cookies",
		"title": "Brenda's Boiled Chocolate Cookies",
		"type": "desserts",
		"about": "This is one of Aunt Brenda's old favorite recipes that she's been making for years. She said Kristy always loved these when she was a kid.",
		"ingredients": [
			"1/2 cup milk",
			"2 cups sugar",
			"3 tbsp cocoa",
			"1/2 cup butter",
			"3 cups oatmeal",
			"1/2 cup peanut butter",
			"1 tsp vanilla extract"
		],
		"instructions": "In a saucepan, mix milk, sugar, cocoa, and butter. ##Bring to a boil over medium heat, remove from heat and add oatmeal, peanut butter, and vanilla extract. ##Drop by tablespoon full onto wax paper, let harden and enjoy."
	},
	{
		"slug": "rhubarb-custard-pie",
		"title": "Rhubarb Custard Pie",
		"type": "desserts",
		"about": "This recipe came from Uncle Jim and Aunt Brenda",
		"ingredients": [
			"3 eggs (slightly beaten)",
			"3 tbsp milk",
			"2 cups sugar",
			"1/4 cup flour",
			"4 cups chopped rhubarb",
			"1 tbsp butter",
			"vanilla ice cream (optional)"
		],
		"instructions": "Mix eggs, milk, sugar, and flour, then add rhubarb. ##Pour into a pie shell and dot with butter. Cover with a lattice top. ##Bake at 400 degrees for 50 - 60 minutes, until browned. Serve warm with vanilla ice cream."
	},
	{
		"slug": "sweet-potato-pie",
		"title": "Sweet Potato Pie",
		"type": "desserts",
		"about": "This is one of Jim and Brenda's favorite dessert recipes.",
		"ingredients": [
			"1 large can or yams or 3 medium cooked yams",
			"1/4 cup melted butter",
			"1 cup sugar (brown or granulated)",
			"2 eggs",
			"1/2 cup evaporated milk",
			"1/2 tsp lemon extract",
			"1 tsp vanilla extract",
			"1/2 tsp nutmeg",
			"1/4 tsp cinnamon"
		],
		"instructions": "Blend all ingredients until smooth. Pour into uncooked pie shell. Sprinkle with coconut if desired. ##Bake at 350 degrees for 35-40 minutes, until crust is golden brown. ##Let cool before slicing."
	},
	{
		"slug": "amys-caramel-rice-krispies",
		"title": "Amy's Caramel Rice Krispies",
		"type": "desserts",
		"about": "From Amy: Although rice krispies have been around forever this recipe offers an unusual slant and it came from a RN that I worked with in home care.",
		"ingredients": [
			"4 c mini marshmallows",
			"1/4 c butter",
			"6 c rice krispies",
			"1 can sweetened condensed milk",
			"2 c mini marshmallows",
			"1/2 c margarine",
			"1 pound  (14 oz) caramels, about 56"
		],
		"instructions": "Melt butter and 4 cups of marshmallows, then add rice krispies. Spread in a buttered 9x13 pan. ##Next melt margarine, 2 cups of marshmallows, condensed milk, and caramels. ##Pour over rice krispies in pan and cool. ##Make a second batch of rice krispies and place over the top of the caramel mixture."
	},
	{
		"slug": "amys-chocolate-waffle-cookies",
		"title": "Amy's Chocolate Waffle Cookies",
		"type": "desserts",
		"about": "From Amy: Thought you might like this recipe since you now have a waffle iron.  Its easy to make and fun to do with the kids.",
		"ingredients": [
			"For Cookies:",
			"1 c brown sugar",
			"1/2 c vegetable oil",
			"2 eggs, beaten",
			"1/4 c cocoa",
			"1/2 c milk",
			"1 1/2 c flour",
			"1 t baking powder",
			"1/2 salt",
			"1/2 c of nuts if desired, just as good without",
			"1 t vanilla",
			"For Frosting:",
			"2 squares baking chocolate",
			"3 T butter",
			"6 T cream",
			"4 1/2 c powdered sugar",
			"1 t vanilla",
			"pinch of salt"
		],
		"instructions": "Mix cookie ingredients and drop onto a hot waffle iron. Cook the same as you would when making waffles. ##To make the frosting, melt baking chocolate and 3 tablespoons of butter, then add cream, powdered sugar, vanilla, and salt. ##Mix and frost cookies."
	},
	{
		"slug": "sherrys-hot-chocolate",
		"title": "Sherry's Hot Chocolate",
		"type": "desserts",
		"about": "Amy sent this recipe that her Mom used to make every winter when she was a kid.",
		"ingredients": [
			"8 qts powder milk",
			"2 lbs Nestles quick",
			"1 box powered sugar",
			"11 oz non dairy creamer"
		],
		"instructions": "Mix all together and spoon into a cup of boiling water.",
		"img": "http://pellegrinipage.com/recipes/img/elise-sherry.jpg"
	},
	{
		"slug": "pipkin-peanut-clusters",
		"title": "Pipkin Peanut Clusters",
		"type": "desserts",
		"about": "From Amy: These are a tradition for the holidays and can be make with any nut so Ava can enjoy too. This recipe is also easy to multiple and stores and freezes very well.",
		"ingredients": [
			"1 pd Almond bark",
			"1 1q2 oz package semi-sweet chocolate chips",
			"3.5 to 4 cups Spanish peanuts (optional)"
		],
		"instructions": "Melt chocolate chips, add almonds and Spanish peanuts (optional). ##Drop onto wax paper until hard."
	},
	{
		"slug": "amys-waldorf-red-cake",
		"title": "Amy's Waldorf Red Cake",
		"type": "desserts",
		"about": "From Amy: This recipe has an interesting story on its origin and I used to request this cake for my birthdays.  You can find it in many different forms and box kits but the home made is the BEST.",
		"ingredients": [
			"Cake:",
			"1 and 1/2 c sugar",
			"1/2 c butter",
			"2 eggs",
			"2 oz red food coloring",
			"2 T cocoa",
			"1T vanilla",
			"1 t salt",
			"1 c buttermilk",
			"2 and 1/2 c cake flour",
			"1 t baking soda",
			"1 T white vinegar",
			"Frosting:",
			"3 T flour",
			"1 c milk",
			"1 c butter",
			"1 cu sugar",
			"1 t vanilla"
		],
		"instructions": "Begin by making the cake. Cream butter and sugar. Beat in eggs. In small bowl add small amount of red food coloring to cocoa to make a paste. Add to to buttermilk alternately with cake flour and salt, then add vanilla. ##In another bowl combine baking soda and vinegar, when foaming add to cake mixture. ##Bake in two greased and floured round 8 inch cake pans at 350 for 30 minutes. ##When cool take a thread and slice each pan into 2, making 4 layers. ##For frosting, cook milk and flour until thick and then allow to cool. ##In another bowl, cream butter, sugar and vanilla for 15 minutes. ##Mix in flour mixture by spoonfuls and frost all 4 layers.",
		"img": "https://pellegrinipage.com/family-recipes/images/WaldorfRedCake.jpg"
	},
	{
		"slug": "amys-brownies",
		"title": "Amy's Brownies",
		"type": "desserts",
		"about": "From Amy: Anyone who knows me, knows that I love all things chocolate.  This recipe came from an RN that I worked with and when she would bring this into work it was a special treat.  I usually ate more than my share but that was back in the day when I could eat anything and not have to worry about the weight.  My how times have changed, but this recipe is still good.",
		"ingredients": [
			"12 T cocoa",
			"2 sticks butter",
			"2 c sugar",
			"4 eggs",
			"1 t vanilla",
			"1 and 1/4 c flour",
			"1 t baking powder",
			"1 t salt",
			"1 c nuts (this can be omitted if desired)",
			"4 T butter",
			"6 T cocoa",
			"3 T warm water",
			"powdered sugar"
		],
		"instructions": "Melt cocoa and butter until well mixed.  Remove from heat and mix in rest of ingredients in the order they are listed. Be sure to mix well. ##Place in a 9 x 13 pan and bake at 350 for 30 minutes. Cool and frost. ##For frosting, Melt 4 T butter and 6 T cocoa. Remove from heat and blend in 3 T warm water. Stir and beat in 2 c powdered sugar.",
		"img": "https://pellegrinipage.com/family-recipes/images/brownies.jpg"
	},
	{
		"slug": "amys-special-k-bars",
		"title": "Amy's Special K Bars",
		"type": "desserts",
		"about": "From Amy: I love these bars and could eat them by the pan full.  They call for peanut butter but I would try substituting Almond Butter so Ava can enjoy them too.",
		"ingredients": [
			"1 c white corn syrup",
			"1 c sugar",
			"1 1/2 c peanut butter",
			"6 c Special K cereal",
			"6 oz chocolate chips",
			"6 oz butterscotch chips"
		],
		"instructions": "Stir syrup, sugar and peanut butter together and heat until melted. ##Remove from heat and stir in cereal and mix well. ##Press into a 9 x 13 pan. Melt chips and spread over the cereal mixture. ##Let set unitl firm."
	},
	{
		"slug": "neiman-marcus-cookies",
		"title": "Neiman Marcus Cookies",
		"type": "desserts",
		"about": "This is a recipe from Amy. Obviously the name implies where they came from. Amy said they used to make these every Christmas.",
		"ingredients": [
			"2 c butter",
			"2 c sugar",
			"2 c brown sugar",
			"4 eggs",
			"2 t vanilla",
			"4 c flour",
			"5 c blended (place in blender and mix until you have a fine powder) oatmeal",
			"1 t salt",
			"2 T baking powder",
			"2 t baking soda",
			"24 oz semi sweet chocolate chips",
			"1 80 oz Hershey chocolate bar-- grated",
			"3 c chopped nuts (any kind)"
		],
		"instructions": "Cream butter and both sugars until well mixed. Add eggs and vanilla. Mix well. ##In a separate bowl, mix, flour, oatmeal, slat and both sodas. ##Add the two mixtures together, mixing well. Add chips, Hershey bar and nuts. ##Roll into small balls and bake for 10 minutes at 375."
	},
	{
		"slug": "toms-monster-cookies",
		"title": "Tom's Monster Cookies",
		"type": "desserts",
		"about": "Tom has a real sweet tooth and these cookies have a little of everything in them so you can eat them by the dozens.  This recipe can also be easily multiplied to make larger batches or larger cookies.",
		"ingredients": [
			"4 eggs",
			"1 1/3 c sugar",
			"3 c brown sugar",
			"1 t vanilla",
			"1 t white corn syrup",
			"2 1/2 t baking soda",
			"2/3 c butter",
			"1 pound peanut butter",
			"6 c oatmeal",
			"1 c chocolate chips",
			"1 c M&Ms"
		],
		"instructions": "Mix all ingredients well and bake 12 minutes at 350. Do not over bake."
	}
]
