[
	{
		"slug": "jasons-rosemary-ribeye",
		"title": "Jason's Rosemary Ribeye",
		"type": "entrees",
		"about": "This is the steak that Chef Jason Wilson taught me to make for Jessica on the night that I proposed. Although I'm not normally a big ribeye fan, I will always associate this dish with that night. The rosemary adds a really nice herbacious flavor to the dish that Jessica and I have come to enjoy on our steaks ever since then.",
		"ingredients": [
			"2 Bone-in Ribeye steaks (14 - 16 oz each)",
			"4 oz. Chanterelle or similar wild mushrooms",
			"1 head Aspiration (Broccolini)",
			"3 Cippolini Onions (quartered)",
			"4 sprigs Rosemary",
			"Extra Virgin Olive Oil",
			"1 Shallot, chopped very very fine",
			"2 cloves garlic, chopped very fine",
			"3 white anchovies, chopped",
			"Water and Sea Salt as needed"
		],
		"instructions": "Season the steak liberally with Sea Salt and skewer the rosemary sprigs through the steak for extra flavor. ##Sauté the onions in olive oil on medium heat slowly to lightly brown add the mushrooms and aspiration and continue to sauté until the mushrooms are sweaty. ##Add the shallots, garlic and anchovies and a bit of water to prevent burning, add olive oil as needed. ##Grill the steak to desired temperature or use a cast iron skillet to cook both sides crispy and flavorful. ##Slice steak to serve atop the aspiration, mushroom mixture.",
		"img": "https://pellegrinipage.com/family-recipes/images/RosemaryRibeye.jpg"
	},
	{
		"slug": "laurels-turkey-meatloaf",
		"title": "Laurel's Turkey Meatloaf",
		"type": "entrees",
		"about": "Our good friend Laurel gave us this recipe. It originally came from Laurel's sister Aubrey. It's a nice healthy take on traditional meatloaf, but uses ground turkey so its much lower in fat than ground beef. Enjoy!",
		"ingredients": [
			"1 pkg ground turkey meat (1-1.25 lbs.)",
			"1 box frozen chopped spinach, defrosted",
			"2 large or 3 medium carrots, coarsely grated",
			"1/4 yellow onion finely chopped",
			"1/4 cup Italian breadcrumbs",
			"1 egg",
			"Garlic salt",
			"Ground pepper",
			"Ketchup"
		],
		"instructions": "Mix all ingredients, except ketchup, in a medium mixing bowl with hands. ##Season to taste with garlic sat and pepper. ##Pack mixture into an ungreased loaf baking pan. ##Squirt a squiggle of ketchup down the length of the meatloaf. ##Bake at 375*F f,or 55-75 minutes.",
		"img": "https://pellegrinipage.com/family-recipes/images/TurkeyMeatloaf.jpg"
	},
	{
		"slug": "laurens-crockpot-lasagna",
		"title": "Lauren's Lasagna - Crockpot Style",
		"type": "entrees",
		"about": "This recipe came from Jessica's cousin Lauren, who shared it with us after Ava was born. It's a crockpot dish that's easy to make and perfect for large groups, or cold winter days. I'm sure we'll be making it soon.",
		"ingredients": [
			"1 pound (16 ounces) ground beef (or ground turkey)",
			"1/2 cup diced white onion",
			"1 teaspoon minced garlic",
			"1 (24 ounce) jar spaghetti sauce",
			"1/2 cup water",
			"1 (15 ounce) container ricotta cheese",
			"2 cups mozzarella cheese",
			"1/4 cup grated Parmesan cheese",
			"1 whole egg",
			"2 Tablespoons fresh parsley or 2 teaspoons dried parsley",
			"6 uncooked lasagna noodles"
		],
		"instructions": "In a large skillet brown beef and onion. Add garlic and cook for one minute, then drain. ##Add spaghetti sauce and water and simmer for about 5 minutes. Mix ricotta, 1 1/2 cups mozzarella, 2 Tablespoons Parmesan, egg and parsley. ##Pour 1 cup of spaghetti meat sauce into a 4 to 6 quart sized slow cooker. Place half of the noodles and half of the ricotta mixture on top of the sauce. ##Cover with 2 cups of meat sauce. Top with remaining noodles (If the noodles don't fit exactly break them to fit) and cheese mixture and meat sauce. ##Cook on low for 4 to 5 hours or until noodles are soft. Sprinkle with 1/2 cup of mozzarella and remaining parmesan. ##Cover with the lid to melt the cheese and let it sit for 10 minutes before serving. Do not overcook and don't try to speed up the process by cooking it on high. Works best with a 4 to 6 quart size slow cooker.",
		"img": "https://pellegrinipage.com/family-recipes/images/CrockPotLasagna.JPG"
	},
	{
		"slug": "brendas-chicken-and-asparagus",
		"title": "Brenda's Chicken & Asparagus",
		"type": "entrees",
		"about": "This is one of Jim and Brenda's favorite entrees.",
		"ingredients": [
			"1 1/2 lbs. fresh asparagus spears (you can use canned if not in season) or broccoli",
			"4 boneless skinless chicken breast halves",
			"2 T. cooking oil",
			"1/2 tsp. Salt",
			"1/4 tsp. Pepper",
			"1 can cream of chicken soup",
			"1/2 cup mayonnaise",
			"1 tsp. lemon juice",
			"1/2 tsp. curry powder",
			"1 cup of shredded cheddar cheese"
		],
		"instructions": "Partially cook asparagus, drain. Place asparagus in a greased 9-inch square baking pan. ##In a skillet over medium heat brown the chicken breast in the oil, season with salt & pepper. Arrange the chicken over the asparagus. ##In a bowl mix the soup, mayonnaise, lemon juice, and curry powder together; pour over the chicken & asparagus. Cover with foil and bake at 375degrees for 40 minutes or until the chicken is tender and juices run clear. ##Sprinkle with cheese, let stand 5 minutes before serving."
	},
	{
		"slug": "clam-linguine",
		"title": "Clam Linguine",
		"type": "entrees",
		"about": "This is Uncle Jim and Aunt Brenda's favorite linguine with clams recipe. I'm going to have to make this soon because I love that dish.",
		"ingredients": [
			"2 – 3 cans of chopped clams",
			"1 cup shrimp (optional)",
			"8 ounces of linguine pasta",
			"1 Tbl olive oil",
			"1 medium onion diced",
			"1 cup sliced mushrooms",
			"1/2 cup diced celery",
			"2 tsp crushed fresh garlic",
			"3/4 tsp. dried basil",
			"3/4 tsp. dried oregano",
			"1/4 cup minced parsley",
			"1/2 cup parmesan cheese"
		],
		"instructions": "Combine onions, celery, mushrooms, garlic, basil, oregano, in a large skillet. Add clams & shrimp and bring to a boil, reduce heat to low cover and simmer stirring occasionally for about 10-mins or until the vegetables are tender. ##Cook the pasta according to the package, drain well return pasta to the pot, add olive oil and toss to mix. ##Add the clam mixture to the pasta and toss gently until well mixed. Serve & top with parmesan cheese.",
		"img": "https://pellegrinipage.com/family-recipes/images/ClamLinguine.jpg"
	},
	{
		"slug": "jims-italian-beef-pasta",
		"title": "Jim's Italian Beef Pasta",
		"type": "entrees",
		"about": "This is another of Uncle Jim and Aunt Brenda's favorite entrees.",
		"ingredients": [
			"1 1/4 lbs. Boneless sirloin steak or boneless chuck steak cut into ½-inch by 1-inch pieces 1 T. vegetable oil",
			"1 med. chopped onion",
			"1 large clove garlic, minced",
			"1 - 2 tsp. Italian seasoning",
			"2 cans Italian-style chopped stewed tomatoes, untrained",
			"1 can beef broth",
			"1/2 cup red wine",
			"8 - 12 oz. penne pasta",
			"Grated parmesan cheese as desired (I use the 3-chesse Italian blend)"
		],
		"instructions": "Cut steak into pieces. Heat oil in a large skillet over medium heat, cook the steak and stir until browned. Stir in the onion, garlic, and Italian seasoning; cook 2 minutes. ##Add tomatoes, broth, and wine. Bring to a boil. Reduce heat to low, cover tightly and cook on stovetop 60 minutes, or until meat is tender. ##Add penne pasta stirring to separate pasta. Cook covered 20 min. or until pasta is tender. ##Transfer to a deep serving dish and stir in the cheese."
	},
	{
		"slug": "jims-garlic-pasta",
		"title": "Jim's Garlic Pasta",
		"type": "entrees",
		"about": "From Jim and Brenda: For a twist on pasta with garlic and oil, try sprinkling toasted fresh bread crumbs over individual bowls, but prepare them before proceeding with the pasta recipe. We like the crunch of Maldon sea salt flakes for this dish, but ordinary table salt is fine as well. Given the large amount of garlic in this recipe, you may want to mince it in a food processor. A garlic press or chef’s knife are other options.",
		"ingredients": [
			"1 pound spaghetti",
			"6 tablespoons extra-virgin olive oil",
			"1/4 cup minced garlic (about 30 small, 20 medium, 10 large, or 5 extra-large cloves) from 1 or 2 heads",
			"3/4 teaspoon hot red pepper flakes",
			"3 tablespoons chopped fresh Italian parsley leaves",
			"2 teaspoons juice from 1 lemon",
			"1/2 cup coarsely grated Parmesan cheese (optional)"
		],
		"instructions": "Adjust oven rack to lower-middle position, set large heatproof serving bowl on rack, and heat oven to 200 degrees. ##Bring 4 quarts water to rolling boil in large pot. Add 1 tablespoon salt and pasta to boiling water, stir to separate noodles, and cook until al dente; reserve 1/3 cup pasta cooking water and drain pasta. ##While water is heating, combine 3 tablespoons oil, 3 tablespoons garlic, and 1/2 teaspoon salt in heavy-bottomed nonstick 10-inch skillet. Cook over low heat, stirring constantly, until garlic foams and is sticky and straw-colored, 10 to 12 minutes. ##Off heat, add remaining tablespoon raw garlic along with hot red pepper flakes, parsley, lemon juice, and 2 tablespoons pasta cooking water and stir well to keep garlic from clumping. ##Transfer drained pasta to warm serving bowl; add remaining 3 tablespoons olive oil and remaining reserved pasta cooking water and toss to coat. ##Add garlic mixture and ¾ teaspoon salt; toss well to combine. ##Serve immediately, sprinkling individual bowls with portion of Parmesan cheese, if desired."
	},
	{
		"slug": "savory-strawberry-salmon",
		"title": "Savory Strawberry Salmon",
		"type": "entrees",
		"about": "This is another one of Jim and Brenda's favorite seafood dishes. I love savory dishes that include fresh fruit so this is one I'm looking forward to making.",
		"ingredients": [
			"2 pound salmon filet",
			"1 small red pepper julienne",
			"1 small yellow pepper",
			"1 medium onion sliced thin",
			"1 pint strawberries cleaned and sliced",
			"1/4 cup water",
			"1/2 cup honey",
			"1/2 cup fresh baby dill",
			"4 cloves minced garlic",
			"2 tablespoons chopped green onion",
			"Juice from 1 lemon",
			"Tom Douglas Seafood Seasoning Rub"
		],
		"instructions": "Preheat oven to 350 degrees. Place salmon filet on a foil lined pan. Season with seafood rub, then cover and surround fish with peppers, onions and orange slices. Pour lime juice over fish and vegetables. ##Mix strawberries, water, honey, dill, garlic and green onions together. ##Ladle strawberry mixture evenly over salmon. Cover with foil and pierce foil allowing steam to escape. ##Bake for 25 to 30 minutes.",
		"img": "https://pellegrinipage.com/family-recipes/images/SavoryStrawberrySalmon.jpg"
	},
	{
		"slug": "laurens-crockpot-carnitas",
		"title": "Lauren's Crockpot Carnitas",
		"type": "entrees",
		"about": "This is Lauren's recipe for making Carnitas in the crockpot. Carnitas is a classic Mexican recipe for making slow-roasted pork. They're great for making tacos, burritos, or just about any other Mexican dish.",
		"ingredients": [
			"2 pork tenderloins (about 1 pound each)",
			"1 (15 - 18 oz) jar of salsa verde",
			"1 (10 oz) can of Rotel tomatoes",
			"1 (4 oz) can of diced green chiles",
			"1 medium white onion, chopped into large pieces",
			"1/2 teaspoon of cumin"
		],
		"instructions": "Place all of the ingredients in a greased crockpot and cook on low for 8-10 hours or until pork easily forks apart. ##Serve buffet-style with flour tortillas, cheese, cilantro, avocado, tomatoes, lettuce, sour cream and a squeeze of lime. ##Make sure to get some of that yummy sauce the pork is in inside your tortilla.",
		"img": "https://pellegrinipage.com/family-recipes/images/CrockPotCarnitas.jpg"
	},
	{
		"slug": "brendas-creamy-chicken-with-black-beans",
		"title": "Brenda's Creamy Chicken with Black Beans",
		"type": "entrees",
		"about": "This is a crockpot dish that was submitted by Uncle Jim and Aunt Brenda.",
		"ingredients": [
			"3 boneless chicken breasts, cut in 1 - 2 inch cubes",
			"2 (7 1/2 ounce) cans Mexican corn, drained",
			"2 (7 1/2 ounce) cans black beans, rinsed and drained",
			"1 cup salsa",
			"4 ounces neufchatel cheese",
			"2 garlic cloves, minced",
			"1 teaspoon cumin"
		],
		"instructions": "Season chicken, then add all ingredients except the Neufchatel cheese to the crockpot. ##Cook on low for 8 hours. ##Stir in cheese cut into cubes, turn off heat. Let sit for 20-30 minutes. ##Stir to blend in cheese. Serve over rice, chips, or on wraps."
	},
	{
		"slug": "carols-hunters-casserole",
		"title": "Carol's Hunters Casserole",
		"type": "entrees",
		"about": "This is one of Aunt Carol's favorite dishes. She made this for us when Elise was born and we loved it. Even Ava couldn't get enough. To this day she's never liked chicken as much as she did with this dish.",
		"ingredients": [
			"Boneless skinless chicken breast - cut into small pieces",
			"1 pkg. wild rice",
			"10oz. frozen chopped broccoli",
			"1 can sliced water chestnuts",
			"1 can (4oz) sliced mushrooms",
			"1 jar cheez-whiz",
			"1 can cream of mushroom soup",
			"2 tbsp. butter",
			"2 tbsp. chopped onion",
			"paprika"
		],
		"instructions": "Cook rice according to directions; set aside. ##Drain mushrooms and water chestnuts. Saute onion, mushrooms, and water chestnuts in butter for 2 minutes. ##Cook broccoli according to package directions. Add broccoli to sauteed veggies and add cheez-whiz (while hot). ##Drain rice and add to veggies with cream of mushroom soup. Add chicken and mix well. ##Bake covered in a casserole dish, topped with paprika, for 40 minutes at 350 degrees."
	},
	{
		"slug": "oven-fried-chicken",
		"title": "Oven Fried Chicken",
		"type": "entrees",
		"about": "This is a dish we found on the Food Network's website. We love eating fried chicken but its normally pretty unhealthy and difficult to make at home because of all the oil it requires. This dish is baked so its much better for you. Hope you enjoy!",
		"ingredients": [
			"2 chickens (3 pounds each), cut in 8 serving pieces",
			"1 quart buttermilk",
			"2 cups all-purpose flour",
			"1 tbsp. salt",
			"1 tbsp. pepper"
		],
		"instructions": "Place the chicken pieces in a large bowl and pour the buttermilk over them. Cover with plastic wrap and refrigerate overnight. ##Preheat the oven to 350 degrees F. Combine the flour, salt, and pepper in a large bowl. Take the chicken out of the buttermilk and coat each piece thoroughly with the flour mixture. ##Pour the oil into a large heavy-bottomed stockpot to a depth of 1-inch and heat to 360 degrees F on a thermometer. ##Working in batches, carefully place several pieces of chicken in the oil and fry for about 3 minutes on each side until the coating is a light golden brown (it will continue to brown in the oven). Don't crowd the pieces. Remove the chicken from the oil and place each piece on a metal baking rack set on a sheet pan. Allow the oil to return to 360 degrees F before frying the next batch. ##When all the chicken is fried, bake for 30 to 40 minutes, until the chicken is no longer pink inside. Serve hot.",
		"img": "https://pellegrinipage.com/family-recipes/images/OvenFriedChicken.jpeg"
	},
	{
		"slug": "beef-stroganoff",
		"title": "Beef Stroganoff",
		"type": "entrees",
		"about": "This recipe came from an old friend of Jessica's from high school.",
		"ingredients": [
			"1 1/4 pound cubed beef stew meat",
			"2 cans condensed cream of mushroom soup (98% fat free for a healthier choice)",
			"1 chopped onion",
			"2 Tbsp Worcestershire Sauce",
			"1/4 c. water or broth (a little more if you want saucy)",
			"dash of garlic salt",
			"8 oz cream cheese (cut up)",
			"Egg noodles or Amish noodles"
		],
		"instructions": "In slow cooker, combine uncooked meat and all ingredients EXCEPT cream cheese and noodles. ##Cook on low setting for 8 hrs or high for about 5 hrs. ##Approx. 15-20 min before serving, add the cream cheese; stir occasionally until melted. ##Approx. 10 minutes before serving, add uncooked noodles, push down in sauce to get lightly coated; replace lid, but stir occasionally until noodles are soft & ready to eat. *A small can of mushrooms or fresh mushrooms is a good addition. You can serve with sour cream or not if you wish.",
		"img": "https://pellegrinipage.com/family-recipes/images/BeefStroganoff.jpg"
	},
	{
		"slug": "darrins-chicken-stroganoff",
		"title": "Darrin's Chicken Stroganoff",
		"type": "entrees",
		"about": "This recipe was submitted by Chris Rudd. Here's what she said \"Here is a recipe created by one of my favorite cousins on my dads side.  His name is Darrin Kelly Ketter. Darrin graduated from Marion High School, Marion Iowa and from Kansas City Art Institue. He has managed large historic mansions and large apartment complexes, free lanced as an artist and began a career in real estate (2004). He and his friend Christian reside in Berkeley California.\"",
		"ingredients": [
			"8 oz. dried egg noodles or 16 oz. fresh egg noodles",
			"4 oz. Crimini button mushrooms, cut into small pieces",
			"1/2 yellow onion, diced",
			"1 lb. boneless chicken breast, cut into thin strips",
			"2 tsp. chicken bouillon or 2 cubes",
			"1 (8-oz.) pkg cream cheese",
			"1 T. fresh chopped parsley (set aside for garnish)",
			"1 garlic clove",
			"1/2 tsp. dried sage",
			"1/4 tsp. dried rosemary",
			"1/4 tsp. dried tarragon",
			"1/2 tsp. fresh black pepper",
			"8 oz. milk or cream"
		],
		"instructions": "In a large soup or pasta pot boil the egg noodles until al dente (almost done). Meanwhile, in a medium sauté pan, sauté the mushrooms, garlic and onions in a small amount of olive oil or butter until the onions are translucent. ##Add the strips of chicken and cook until almost done (do not brown). Add the herbs, bouillon and black pepper and allow them to cook with the chicken for a minute or two. Add the cream cheese and allow to melt into a sauce, stirring constantly. ##Add milk a little at a time and stir into sauce to think the mixture and stir until bubbly (do not use all of the milk if you prefer a thicker sauce). ##Once the mixture is the consistency of your preference, spoon over the egg noodles and top with parsley. Makes 4 servings.",
		"img": "https://pellegrinipage.com/family-recipes/images/ChickenStroganoff.jpg"
	},
	{
		"slug": "grandma-clute-meatloaf",
		"title": "Chris's Grandma Clute Meatloaf",
		"type": "entrees",
		"about": "This recipe came from Rick and Chris. They said this was Grandpa Rudd's favorite so I'm sure it's good. Enjoy!",
		"ingredients": [
			"2 eggs",
			"3/4 cup milk",
			"1/2 cup breadcrumbs",
			"1/4 cup finely chopped onion",
			"1/2 teaspoon salt",
			"black pepper to taste",
			"1 1/2 lbs. Ground Beef",
			"1/4 cup ketchup",
			"2 tablespoons brown sugar",
			"1 teaspoon mustard"
		],
		"instructions": "Mix egg, milk, breadcrumbs, onion, salt, pepper, and ground beef. ##Place in a baking pan and bake uncovered for 45-50 minutes at 350 degrees. ##For the topping, mix ketchup, brown sugar, and mustard, then spread over meatloaf for the last 10 minutes of baking. Tip: before adding the topping, pour off grease and water and spoon off any junk."
	},
	{
		"slug": "ricks-goulash",
		"title": "Rick's Goulash",
		"type": "entrees",
		"about": "This is Rick's famous Goulash recipe. I say famous because I've heard Jessica talk about it many times. Looking forward to trying it out!",
		"ingredients": [
			"1.5 lbs. Hamburger",
			"Portobello mushrooms",
			"1/2 onion, diced",
			"1 can beef broth",
			"Seasoning Salt",
			"5 cloves garlic, minced",
			"2 cans tomato sauce",
			"Dash Worcestershire",
			"Dash vinegar",
			"Macaroni pasta"
		],
		"instructions": "Cook macaroni and set aside. ##Mix the rest of the ingredients into a pot and cook for 45 minutes until mushrooms and onion are tender. ##Stir in macaroni and serve.",
		"img": "https://pellegrinipage.com/family-recipes/images/rick2.jpg"
	},
	{
		"slug": "gigis-spaghetti-sauce",
		"title": "Gigi's Spaghetti Sauce",
		"type": "entrees",
		"about": "This is the recipe that Gigi taught my Mom many years ago. I grew up on this dish and it will always be the perfect spaghetti sauce in my mind. Gigi was famous for never cooking with a recipe and always making due with whatever she had to work with. She always used to tell us, 'You cook with what you have.' I try to apply that sentiment with every meal I make, and I'm sure Jessica is already tired of hearing me say it. Even in her mid 80's, Gigi was still making dinner for a dozen people in her little kitchen in Aberdeen. Although I only caught the tail end of those years, I vividly remember how special of a time it was. Lots of great stories, big personalities, and amazing food.",
		"ingredients": [
			"1/2 lb. extra lean ground beef",
			"1/2 lb. fresh ground pork",
			"Italian Sausage or small Rump Roast",
			"Sliced Mushrooms (canned or sliced)",
			"1 large onion - minced",
			"3-4 cloves of garlic - minced",
			"Handful of fresh parsley - minced",
			"1/2 tsp. Ground Sage",
			"1/2 tsp. Rosemary",
			"1/2 tsp. Allspice",
			"2 Cloves, chopped (optional)",
			"2 strips Lemon peel - minced",
			"Salt & Pepper to taste",
			"3 cans tomato sauce",
			"1 can chicken broth"
		],
		"instructions": "Sautee onion & garlic in olive oil, add 1/2 lb. extra lean ground beef and 1/2 lb. fresh ground pork, brown well, drain if necessary. ##Add sage, rosemary, lemon peel, allspice, parsley, salt & pepper, and cloves. My mom never made the sauce with cloves so it's up to you. Also add tomato sauce, chicken broth, and mushrooms, then simmer for 2-3 hours. You can go as long as 6 hours in a crockpot on low heat. ##If you're adding Italian sausage, brown them in a pan with garlic and onion before adding to the sauce. ##If you're adding a small rump roast, season the roast and stuff it with whole garlic cloves, brown in a pan, then add to spaghetti sauce. Allow sausages/roast to cook in sauce for 2 hours before serving.",
		"img": "https://pellegrinipage.com/family-recipes/images/Gigi.jpg"
	},
	{
		"slug": "elmers-veal-and-potatoes",
		"title": "Elmer's Veal & Potatoes",
		"type": "entrees",
		"about": "This is one of my Dad's favorite dishes. I remember coming home from Karate at night and having this for dinner so many times. This is definitely where I got my love for veal.",
		"ingredients": [
			"Thin veal cutlets, cut into small pieces",
			"2 eggs, whisked in a bowl",
			"Italian breadcrumbs",
			"Potatoes (any kind)",
			"olive oil",
			"Salt & Pepper to taste"
		],
		"instructions": "Dip veal pieces into whisked egg, then into seasoned breadcrumbs. Place on a plate covered with wax paper. ##Peel and slice potatoes into thin pieces, then dip in egg and breadcrumbs. Also place on a plate with wax paper. ##Place plates in a refrigerator for a couple hours before frying. ##Heat a fair amount of oil and cook meat and potatoes until brown. The meat cooks quickly but the potatoes take some time.",
		"img": "https://pellegrinipage.com/family-recipes/images/ElmerPellegrini.jpg"
	},
	{
		"slug": "nanas-beef-and-biscuits-casserole",
		"title": "Nana's Beef & Biscuits Casserole",
		"type": "entrees",
		"about": "This was one of my Grandma's (Nana) favorite dishes. Feeding a family of 7 was no easy task and this was one of her staples.",
		"ingredients": [
			"1 package of biscuits",
			"2 lbs. hamburger",
			"1 large onion",
			"1 green bell pepper",
			"3 celery stalks",
			"2 cans Cream of Celery or Cream of Mushroom soup",
			"Beef broth",
			"Shredded Cheddar cheese",
			"Salt & Pepper to taste"
		],
		"instructions": "Dice 1 large onion,1 green pepper and 3 stalks of celery. Brown 2 lbs. of hamburger, drain oil, mix in onion, pepper, onion, celery, season with salt & pepper. ##Add 2 cans of cream of celery soup or cream of mushroom. Simmer until meat is thoroughly cooked with soup, add water or beef broth if needed. ##Pour into a 9x12 cake pan, cover with slices of cheddar cheese, on top of cheese cover with uncooked package biscuits. ##Bake in oven at 350 until biscuits rise & brown.",
		"img": "https://pellegrinipage.com/family-recipes/images/Nana.jpg"
	},
	{
		"slug": "gigis-tripe",
		"title": "Gigi's Tripe",
		"type": "entrees",
		"about": "Although tripe isn't the most popular dish today, back in the old days it was a crowd favorite. This recipe of Gigi's was printed in the Italian Lodge of Aberdeen's cookbook. It was credited to Norena Pellegrini, which is funny because I always thought she spelled it Norina. Either way she will always be Gigi to me. This picture is of her and Kallan when he was a little boy, at Sydney's house, Easter 2001.",
		"ingredients": [
			"5 lbs. honeycomb tripe",
			"1 large onion, chopped fine",
			"2 cloves garlic, minced",
			"1/2 cup parsley, chopped",
			"1 small carrot, chopped fine",
			"1 tsp. dried oregano",
			"2 bay leaves",
			"1/2 tsp. lemon rind",
			"allspice to taste",
			"salt & pepper to taste",
			"1 lg. can tomatoes",
			"1 sm. can tomato sauce",
			"beef broth (optional)",
			"white wine (optional)",
			"Parmesan cheese"
		],
		"instructions": "Scald tripe for about 15 minutes. Drain and cut up into narrow strips. In the meantime, saute the onion, garlic, carrot, and parsley gently. ##Add the tomatoes, bay leaves, lemon rind, salt, pepper, allspice and oregano. Simmer slowly, add the tripe and cook until tender to taste. Can be 1.5 hours or more. Serves 6. ##Add beef broth and white wine if sauce gets to,o dry. Sprinkle Parmesan cheese on top when ready to serve.",
		"img": "https://pellegrinipage.com/family-recipes/images/Dad_Gigi1.jpg"
	},
	{
		"slug": "ritas-scallop-asparagus-risotto",
		"title": "Rita's Scallop Asparagus Risotto",
		"type": "entrees",
		"about": "This is one of my Mom's favorite recipes. She's made it for me so many times and I've always loved it. Highly recommended.",
		"ingredients": [
			"1 cup Arborio rice",
			"Fresh Sea Scallops, cleaned",
			"Fresh Asparagus spears, chopped into 1 inch pieces",
			"2 tablespoons pure olive oil",
			"1 large onion, peeled and finely diced",
			"1.5 cups dry white wine",
			"2.5 cups chicken stock",
			"2 tablespoons unsalted butter",
			"Freshly grated Parmesan cheese",
			"2 tablespoons heavy cream",
			"Salt & Pepper to taste"
		],
		"instructions": "Pick through the rice to remove any stones or foreign matter, but do not wash it before cooking. Using a large skillet with a heavy bottom, heat the olive oil over low heat and sauté or 'sweat' the onions until translucent, being careful not to allow them to color or brown at all. Add the Asparagus and Arborio rice, stir to coat with the olive oil, and sauté with the onions to toast each grain of rice, about 7 minutes. This toasting process adds the chewy, al dente quality that attracts so many people to risotto. ##Once the rice is lightly toasted, add the white wine slowly, stirring with a wooden spoon. (A wooden spoon is always preferable when making risotto, as a metal spoon tends to cut or injure the grains of rice. Constant stirring should be avoided for the same reason.) ##Preheat the chicken stock just to the boiling point, and then have it ready at stove side. After the rice has absorbed the white wine and the skillet is nearly dry, add 1 cup stock, stirring occasionally¥, and cook over very low heat until the stock is absorbed. ##Add scallops and continue adding the stock, 1 cup at a time, until all the stock has been absorbed. (Adding the liquid in stages, instead of all at once, allows the grains of rice to expand more fully, adding to the risotto's creamy texture.) Once the rice has been added to the pan, the entire cooking process will take about 17 to 20 minutes. ##After all of the liquid has been added and the rice is chewy yet fully cooked, with a creamy texture, add the butter, Parmesan, and heavy cream.   Stir to combine all the ingredients and serve immediately. ##Variations: Sautéed shrimp Mixed seafood (such as salmon, shrimp, and scallops) sautéed in olive oil and herbs Diced fresh vegetables, steamed or sautéed in olive oil (asparagus and carrots make a wonderful combination) Fresh green peas in season Sautéed mushrooms and herbs Roasted Garlic.",
		"img": "https://pellegrinipage.com/family-recipes/images/portofino.jpg"
	},
	{
		"slug": "ritas-pot-roast",
		"title": "Rita's Pot Roast",
		"type": "entrees",
		"about": "This is one of my favorite dishes my Mom makes, and its a recipe that I specifically asked for. I've never been able to make pot roast as good as my Mom's so I hope everyone enjoys this recipe.",
		"ingredients": [
			"4-6 pounds chuck roast",
			"1 packet dry onion soup mix",
			"6 cups beef broth",
			"1 package small baby carrots",
			"1 onion, chopped",
			"2 cloves of minced garlic",
			"1 bag of fresh sliced mushrooms or 4 cans of sliced mushrooms",
			"salt and pepper to taste",
			"5lb bag of potatoes",
			"Optional ingredients:, mushrooms, splash of red wine vinegar, a few sprigs of fresh thyme & rosemary"
		],
		"instructions": "Season the roast with salt and pepper to taste. Brown on all sides in a large skillet over high heat, about 4 minutes per side. It really does not need to be browned first. I have cooked in the oven or crock pot without browning and it still browns nicely while cooking. Although, I do like to sauté the garlic and onion in olive oil first. ##Place the roast in the slow cooker and add the soup mix, beef broth, onion, garlic, seasoning. Be sure to cover entire roast with liquid. Add more broth or water if needed. Slow cook 6 to 8 hours depending on size of roast. ##Add carrots and potatoes last hour or so. If you would like to make a thicker gravy after the meat and vegetable have cooked, strain broth in to a stovetop pan, take 2 cups of the broth out and add flour. I can’t say exactly how much flour, just enough to thicken the broth, whisk the broth and flour together until they are smooth (no lumps). ##Slowly pour small amounts of the floured broth back in to the pan and using a whisk keep stirring until the broth becomes a gravy of whatever consistency you like. You may not need all of the floured broth if your gravy thickens right away. If it doesn’t thicken you may need to add more flour to your 2 cups of broth.",
		"img": "https://pellegrinipage.com/family-recipes/images/MomItaly.jpg"
	},
	{
		"slug": "sweet-n-spicy-pork-chops",
		"title": "Sweet 'n Spicy Pork Chops",
		"type": "entrees",
		"about": "This is a dish that we just made on one of our 'Football Sundays' at home. It's a crockpot dish that's super easy to make, and we actually used frozen pork chops, which turned out to be perfectly fine because you're slow cooking them for so long. Jessica said it was one of her favorite meals we'd had in a long time, which was quite a compliment considering she doesn't normally like pork chops. We served it with sautéed veggies and fried polenta but you can use pretty much anything you like. Hope you enjoy!",
		"ingredients": [
			"2-4 lean pork chops",
			"1-2 apples, thinly sliced",
			"3 tbsp brown sugar",
			"~1/2 tsp cayenne pepper",
			"1 tsp vanilla extract",
			"1/2 cup white wine",
			"1/2 cup apple juice",
			"1/2 tsp ground cinnamon",
			"1/4 cup fresh basil, roughly chopped",
			"1/4 cup fresh mint, roughly chopped",
			"3-4 garlic cloves, minced",
			"1/4 cup lemon juice",
			"salt & pepper to taste"
		],
		"instructions": "Combine all ingredients in a crockpot and cook on low temperature for about 5 hours. Stir occasionally and flip the pork chops once around the half-way point."
	},
	{
		"slug": "normas-ravioli",
		"title": "Norma's Ravioli",
		"type": "entrees",
		"about": "This is one of my all-time favorite dishes. It's been made over the years by Gigi, Aunt Norma, and Sydney, but for me it will always bring back memories of Christmas dinner at Norma's house. There are a lot of family stories that go with this dish. My favorite memories are of my Dad searching all over Norma's kitchen/house for evidence of her making Ravioli. She would always deny it and say she didn't have time to do it this year, but somehow those ravs would always make their way to the dinner table. A word of caution for anyone that wants to make this dish: it takes several days to make. The pasta is made by hand from scratch, and so is the meat filling. It's a ton of work, but I can't wait to do on my own sometime soon. Thank you so much to Sydney for giving me this recipe. This site wouldn't be complete without it.",
		"ingredients": [
			"Ingredients for homemade pasta",
			"3 cups all-purpose flour",
			"4 eggs",
			"2 tablespoons olive oil",
			"1/2 teaspoon salt",
			"2 to 10 teaspoons water (optional)",
			"Ingredients for meat filling",
			"2.5 tablespoons butter",
			"2 tablespoons olive oil",
			"1/4 cup minced onion",
			"2.5 teaspoons minced fresh rosemary",
			"2 teaspoons dried Italian herb mix",
			"1 teaspoon minced fresh garlic",
			"3/4 lb. lean ground beef",
			"2 ounces ground pork shoulder (OR 1 or 2 baked pork chops; cut the cooked meat off the bone and grind it.)",
			"1 small package frozen chopped spinach, thawed and drained",
			"5 tablespoons grated Parmesan cheese",
			"1/4 cup breadcrumbs",
			"2 egg yolks",
			"Salt and pepper to taste (Start with ½ teaspoon salt and 1/8 teaspoon pepper)"
		],
		"instructions": "Start by making the pasta. This recipe makes approximately 8 main-course servings. Using a food processor: Combine flour, eggs, oil and salt in work bowl. Process until dough just comes together, about 10 seconds. If dough appears dry, add water through feed tube, 1 teaspoon at a time, until firm dough forms, processing 5 seconds after each addition of water. ##Turn dough out onto lightly floured surface and knead until smooth. Run small portions of dough through pasta machine (if available,) to form thin sheets of pasta. Do not run dough through machine too quickly. Catch dough as soon as it comes out of machine and drape it over a pasta rack or baking rack (the kind you use for cooling baked cookies.) If you do not have a pasta machine (our grandmother and aunt did not,) roll the dough with a rolling pin on a well floured surface until each sheet is thin enough for use. You will discover arm muscles you didn’t know you had as you roll the dough to the desired thinness. Drape sheets of pasta as described above. ##Now it's time to make the meat filling. This recipe makes about 1.5 cups of filling. Melt butter and oil in heavy skillet over medium-low heat. Add onion and sauté until softened, stirring frequently, about 5 minutes. Mix in rosemary, dried herbs and minced garlic. Increase heat to medium and add ground beef and ground pork shoulder, salt and pepper. Saute the mixture, stirring, until beef is no longer pink, about 5 minutes. Add spinach. If using cooked ground pork chop, add after beef is cooked through, stir, and then transfer entire mixture to bowl. Cool to room temperature. Stir in Parmesan cheese, breadcrumbs and egg yolks into meat mixture. Taste and adjust seasonings. Cover and refrigerate 30 minutes. (Can be prepared 1 day ahead.) ##To assemble ravioli: Lay a thin pasta sheet on floured surface. Place small mounded spoonfuls of meat and herb mixture in rows, leaving at least 1 inch of space around each mound. Cover with another sheet of pasta. Using a small drinking glass (the old-fashioned way) or a knife (more efficient way), cut each row into separate rounds or squares. Use a fork to crimp the edges of each ravioli (so the filling will stay within the pasta during cooking.) ##Refrigerate or freeze until ready to cook. To cook: Heat a large pot of salted water until boiling. Gently lower about a dozen ravioli into the water at a time. Cook until the ravioli float to the water’s surface and are tender. (Taste to test for tenderness.) Transfer batch to a warm bowl and cook next batch. ##Serve with your favorite spaghetti sauce and more grated Parmesan cheese. Buon appetito!",
		"img": "https://pellegrinipage.com/family-recipes/images/AuntNorma.jpg"
	},
	{
		"slug": "chicken-enchiladas-suizas",
		"title": "Chicken Enchiladas Suizas",
		"type": "entrees",
		"about": "This dish was submitted by Jessica's cousin Heather. It's one of her favorites, and anything with the word enchilada in it gets a thumbs up from me, so I'm looking forward to trying it out very soon.",
		"ingredients": [
			"6 boneless skinless chicken breast halves",
			"1 tbsp butter",
			"1 cup chopped onion",
			"1 green bell pepper, seeded and chopped",
			"1 red bell pepper, seeded and chopped",
			"8 oz grated cheddar cheese",
			"1 oz diced green chiles",
			"1 cup green chile salsa (salsa verde)",
			"1/2 cup fresh cilantro, chopped",
			"4 tsp ground cumin",
			"2-3 canned chipotle chiles in adobo sauce (optional)",
			"salt & pepper to taste",
			"12-15 7 inch flour tortillas",
			"10 oz Monterey Jack cheese, grated",
			"1 cup whipping cream",
			"1/2 cup chicken broth",
			"1 avocado, chopped (for garnish)",
			"1 tomato, diced (for garnish)",
			"Chopped cilantro (for garnish)"
		],
		"instructions": "Preheat oven to 350 degrees. Place chicken in pan of rapidly boiling water, cover, and simmer for 15-20 minutes. Remove from heat, drain, cool, and shred chicken. ##In a medium sized skillet, melt butter over medium heat. Cook bell peppers and onion until just soft, about 5-8 minutes. Transfer to a large bowl. Add chicken, cheddar cheese, green chiles, salsa, cilantro, cumin, and chipotle chiles if desired. Season with salt and pepper to taste, and mix well. ##Grease a 10x15x2 inch baking pan, or two smaller pans. Place one flour tortilla on a flat surface and add about 1/2 cup of shredded chicken mixture along one edge. Roll up the tortilla from the filling side and place seam side down in the pan. Repeat this process until the chicken mixture is gone. ##Sprinkle Monterey Jack cheese over the enchiladas. This may be prepared up to this point in advance if you wish. Combine cream and chicken broth and pour over enchiladas. ##Cover the pan with foil and bake for 30 minutes at 350 degrees. Remove foil and continue baking for 10 minutes, or until thoroughly heated. ##Place one or two enchiladas on individual serving plates and garnish with avocado, tomatoes, and additional cilantro, if desired.",
		"img": "https://pellegrinipage.com/family-recipes/images/ChickenEnchiladasSuizas.jpg"
	},
	{
		"slug": "heathers-southwestern-lasagna",
		"title": "Heather's Southwestern Lasagna",
		"type": "entrees",
		"about": "Jessica's cousin Heather submitted this recipe. Looks like a fun take on an old classic. I love lasagna and Tex-Mex so this looks great.",
		"ingredients": [
			"2 Tbsp. olive oil",
			"2 medium onions, chopped fine",
			"2 cloves of garlic, minced or crushed",
			"20 oz. can diced tomatoes in juice",
			"8 oz. can tomato sauce",
			"4 oz. can chopped mild green chilies",
			"1 can black beans",
			"1 can yellow corn",
			"3 Tbsp. chili powder",
			"1 Tbsp. cumin",
			"1/2 tsp. salt",
			"1/2 tsp. pepper",
			"1 pound lasagna noodles",
			"1/2 pound monterray jack cheese",
			"1 cup grated parmesan cheese",
			"1 pound cottage cheese, small curd"
		],
		"instructions": "Heat oven to 350. In a medium saucepan, combine oil, onion, garlic and cook over medium-high heat for 5 minutes. Add tomatoes, juice, sauce, chilies, chili powder, cumin, salt, pepper and black beans. Bring to a simmer over medium heat. Reduce to a low and simmer, uncovered for 35 minutes, stirring occasionally. ##In a large pot, cook lasagna noodles until al dente. In a medium bowl, toss cheeses together. Rinse noodles under cold water and drain well. Add corn (drained) to the sauce – this is optional, I added it to the recipe. ##Spoon some sauce into the bottom of a 9x13 pan. Make 3 layers, using the following sequence: noodles, cottage cheese, sauce and grated cheeses. (using only 3/4 of the grated cheese mixture) Top with any remaining cheese. ##Bake 35 minutes until bubbly and brown on top. (May want to broil for a few minutes to achieve browning) Let stand for 15 minutes before serving."
	},
	{
		"slug": "jims-spaghetti-carbonara",
		"title": "Jim's Spaghetti Carbonara",
		"type": "entrees",
		"about": "This is Jim and Brenda's Spaghetti Carbonara recipe.",
		"ingredients": [
			"1/2 lb chopped bacon or pancetta",
			"1 tbsp minced garlic",
			"1 cup parmesan cheese",
			"1 lb spaghetti pasta",
			"4 beaten eggs",
			"Salt & Pepper to taste",
			"1 tbsp parsley leaves"
		],
		"instructions": "Cook spaghetti to al dente, then drain and set aside. ##In a large saute pan, cook bacon or pancetta over medium heat about 8 minutes, until crispy and the fat is rendered. Remove bacon from pan, but keep the fat behind. Add minced garlic to the fat and cook for one minute until garlic starts to sizzle. Season with black pepper. ##Add cooked pasta to the pan. Use tongs to toss pasta around in the pan. If there is not enough fat to cook all the pasta, add olive oil. Cook for 1-2 minutes until pasta is warm. ##Add cooked bacon/pancetta back into the pan. Remove pan from heat. Add the eggs while continuing to toss the pasta around in the pan. Stir in the parmesan cheese. Once the cheese melts, the dish is done. ##Season with salt and pepper to taste. Garnish with chopped parsley. Serves four."
	},
	{
		"slug": "sherrys-hamburger-casserole",
		"title": "Sherry's Hamburger Casserole",
		"type": "entrees",
		"about": "Amy submitted this recipe on behalf of her Mom. Originally known as 'Delicious Hamburger Casserole', this is one of everyone's favorite dishes by Sherry. Its easy to make and can be frozen if desired.  It is also very good reheated.",
		"ingredients": [
			"1 and 1/2 lbs ground beef, browned and drained",
			"16 oz tomato sauce",
			"1 t salt",
			"1/2 t pepper",
			"1 t sugar",
			"1/8 t garlic salt",
			"3oz Cream Cheese",
			"1 medium onion chopped",
			"1 c sour cream",
			"Wide Noodles (or any other type of pasta)"
		],
		"instructions": "After browning and draining the ground beef, mix in the following and simmmer for 15-20 minutes: tomato sauce, salt, pepper, sugar, and garlic salt. ##Cook and drain the pasta. Add pasta to beef mixture, then mix in cream cheese, sour cream, and onion. ##Add everything to a 9x13 pan and bake at 350 for 25-30 minutes."
	},
	{
		"slug": "toms-cajun-pot-roast",
		"title": "Tom's Cajun Pot Roast",
		"type": "entrees",
		"about": "Tom loves anything Cajun and this slow cooker recipe is easy and good.",
		"ingredients": [
			"1 boneless beef chuck roast ( 2 - 2 1/2 pounds)",
			"3 t Cajun seasoning  (add more to your liking)",
			"9 oz corn",
			"1/2 c chopped onion",
			"1/2 chopped green bell pepper",
			"1 can Muir Glen diced tomatoes, drained",
			"1/8 t pepper",
			"1/2 t red pepper sauce"
		],
		"instructions": "Line a 5-61/2 qt crock pot with a slow cooker liner. Rub the surface of the roast wit the Cajun seasoning and place in the slow cooker. Top with corn, onion and bell pepper. ##In a small bowl, mix tomatoes, pepper and pepper sauce. Pour over vegetables and beef. ##Cook on low for 8 - 10 hours. ##Remove beef from cooker and slice. Using slotted spoon, remove corn mixture and serve with beef."
	},
	{
		"slug": "vegan-eggplant-parmesan",
		"title": "Vegan Eggplant Parmesan",
		"subtitle": "with Garlicky Tomato Sauce and Lemon Basil Couscous",
		"type": "entrees",
		"about": "One of Jessica and Michael's faovrite dishes from Purple Carrot",
		"ingredients": [
			"1 eggplant",
			"1 shallot",
			"4 garlic cloves",
			"1 lemon",
			"1oz fresh basil",
			"1oz vegan shredded mozzarella",
			"1/4 cup panko breadcrumbs",
			"2 tsp Italian seasoning",
			"14.5oz fire roasted diced tomatoes",
			"1 cup Israeli couscous"
		],
		"instructions": "Preheat oven to 425 degrees. Trim eggplant and cut lengthwise into 4 planks. Place on a baking sheet and toss with 1 tablespoon olive oil and a pinch of salt and pepper. Bake until lighly browned on each side, flipping halfway through, 15-20 minutes. ##Peel and mice the shallot and garlic. Zest and halve the lemon - juice one half and cut the other half into wedges. Pick and tear the basil leaves. Add half of the minced garlic, mozzarella, panko breadcrumbs, and 2 teaspoons of olive oil to a small bowl. Toss to combine. ##Heat 1 tablespoon of olive oil in a medium saucepan over medium-high heat. Add minced shallot, remaining minced garlic, and Italian seasoning. Cook until fragrant, 2-3 minutes. Add tomatoes, 1/4 teaspoon salt, and a pinch of pepper, then reduce heat to medium-low. Simmer until sauce is slightly thickened, 5-7 minutes. ##Add 1 1/4 cups of water and a pinch of salt to a small saucepan and bring to a boil. Add Israeli couscous, reduce heat to low, and cook, covered, until water is absorbed, 10-12 minutes. Add lemon zest, lemon juice, half of the torn basil leaves, 2 teaspoons olive oil, and a pinch of salt and pepper. Stir the lemon basil couscous to combine. ##Remove the baked eggplant from the oven and top with garlicky tomato sauce and breadcrumb mixture. Return to oven and bake until breadcrumbs are golden brown, 4-6 minutes. ##Divide the lemon basil couscous and eggplant parmesan between bowls. Top with remaining torn basil leaves and serve with lemon wedges. Tuck in!",
		"img": "https://pellegrinipage.com/family-recipes/images/VeganEggplantParmesan.jpg"
	},
	{
		"slug": "bulgogi-noodle-bowl",
		"title": "Bulgogi Noodle Bowl",
		"type": "entrees",
		"about": "This is a vegan/gluten-free dish Jessica and Michael got from Green Chef and really enjoyed. Definitely a keeper! Serves 2.",
		"ingredients": [
			"2 whole Portobello Mushrooms",
			"1/2 cup Bulgogi-style amino sauce",
			"4 1/4oz Pad Thai rice noodles",
			"6oz Broccoli",
			"1 3/4oz Bell Pepper",
			"1 3/4oz sliced Carrots",
			"2oz diced Yellow Onions",
			"1/2oz Dry-roasted cashews",
			"1/2oz Pickled Ginger",
			"1 tsp Black & White Sesame Seeds"
		],
		"instructions": "Wipe portobello mushrooms clean with damp paper towels. Remove any stems. Scrape out gills with a spoon. Cut lengthwise into strips, about 1/4 inch thick, then halve the strips widthwise. Cut broccoli into bite-size pieces (if necessary). Cute bell pepper lengthwise into strips, about 1/4 inch thick. Halve the strips widthwise. Roughly chop dry-roasted cashews (if necessary). ##Place mushrooms in a medium bowl. Add bulgogi-style amino sauce. Season with about 1/4 teaspoon of salt and a pinch of pepper. Stir to coat. Marinate at least 5 minutes, stirring occasionally. ##Bring a large pot of lightly salted water to a boil. Add Pad Thai rice noodles and about 1 teaspoon cooking oil to the boiling water. Stir. Cook 6-8 minutes, or until noodles are al dente, stirring occasionally. Strain noodles. Rinse with cold water; shake off excess water. Return to pot. ##Heat about 1 1/2 tablespoons cooking oil in a large saute pan over medium-high heat. Add broccoli and bell pepper to hot pan. Season with about 1/4 teaspoon salt and a pinch of pepper. Cook about 3 minutes, or until veggies begin to brown, stirring occasionally. Add yellow onions. Cook about 4 minutes, or until veggies begin to soften, stirring occasionally. Add carrots and about 1/4 cup of water. Cook about 2 minutes, or until veggies are tender and liquid is cooked off, stirring occasionally. Remove from heat. Transfer noodles to pan. Add cashews. Salt and pepper to taste. Stir to combine. ##Heat about 1 tablespoon cooking oil to a medium saute pan over medium-high heat. Add mushrooms (with any excess marinade) to hot pan. Cook 5-7 minutes, or until mushrooms are tender, stirring occasionally. ##Divide stir-fried veggies and noodles between bowls. Top with bulgogi mushrooms. Spoon any remaining sauce from the pan over top. Garnish with pickled ginger and blaci & white sesame seeds. Enjoy!",
		"img": "https://pellegrinipage.com/family-recipes/images/BulgogiNoodleBowl.jpg"
	}
]
