[
	{
		"slug": "michaels-fried-avocado-crab-salad",
		"title": "Michael's Fried Avocado Crab Salad",
		"type": "salads",
		"about": "This is based on a salad we used to serve at Waterfront Seafood Grill when I worked there years ago. I modified it by frying the avocados and adding fresh mango. It's a great summer salad featuring fresh Dungeness crab, butter lettuce, and a scallion-yogurt dressing. I've been making it for years and its usually a hit. Hope you enjoy.",
		"ingredients": [
			"2 bunches of butter lettuce",
			"1 lemon - squeezed",
			"1 mango - peeled & diced",
			"1/2 pound of fresh Dungeness crab meat",
			"3 cups of plain yogurt",
			"1 cup of mayo",
			"Juice from 1/2 lemon",
			"1 bunch of green onions - diced",
			"1 clove of garlic - diced",
			"1 avocado",
			"1 egg",
			"4 cups of vegetable oil",
			"Panko (Japanese Breadcrumbs)",
			"Salt & Pepper"
		],
		"instructions": "Start by making your scallion-yogurt dressing. Add the yogurt, mayo, lemon juice, green onions, garlic, and salt & pepper to a blender and blend for 5 - 10 seconds. Taste and season if necessary.  ##Peel your avocado and slice into eighths. Crack an egg into a bowl and stir vigorously with a fork for 30 seconds. Pour 2 cups of Panko breadcrumbs onto a plate and place next to the bowl of egg.  ##Place vegetable oil in a pan on the stove top, set heat to medium. Season the avocado slices with salt & pepper,  dip a slice in the egg, coat it in Panko, and set aside. Repeat for remaining avocado slices. ##Now that your oil has heated place the avocado slices in the pan. Flip each slice after frying for a couple minutes. You're looking for a nice golden brown color. After frying the avocado slices, place them on a paper towel to soak up excess grease. ##Place butter lettuce in bowls, then sprinkle mango pieces over. Squeeze fresh lemon over each bowl, pour dressing, then garnish with fresh crab meat and fried avocado slices."
	},
	{
		"slug": "jasons-seafood-salad",
		"title": "Jason's Seafood Salad",
		"type": "salads",
		"about": "This is one of the dishes that Chef Jason Wilson, of the restaurant 'Crush' in Seattle, taught me to make on the TV show when I proposed to Jessica. It's a hot/cold salad featuring fresh seafood, fennel, cucumber, and mint.",
		"ingredients": [
			"10 Mussels, alive in shell",
			"6 oz. Fresh #1 Ahi Tuna",
			"1/2 English cucumber, sliced in thin rings",
			"1 bunch mint",
			"1/4 head Fennel, sliced thin",
			"1 meyer lemon",
			"1/4 cup Olive Oil",
			"8 Fresh Large Prawns, Peeled and de-veined",
			"4 oz. Tako (Cooked Octopus)",
			"2 Radishes, sliced thinly"
		],
		"instructions": "In a sauté pan, simmer the fennel & mussels in olive oil until they begin to open, add the prawns and saute until they are lightly cooked and pink, remove from heat and add the cucumber. ##Chop the tuna in large pieces, squeeze in the Meyer lemon juice, tear they mint leaves and add radishes, adjust seasoning with sea salt and olive oil and add the Octopus. ##To plate the salad start with the warm items and top with the cool ones."
	},
	{
		"slug": "heirloom-tomato-vinaigrette",
		"title": "Heirloom Tomato Vinaigrette",
		"type": "salads",
		"about": "This is a nice light salad dressing based on heirloom tomatoes. It's perfect for any type of house or mixed greens salad. ",
		"ingredients": [
			"10oz Heirloom tomatoes",
			"Fresh basil leaves",
			"Juice of 1 large lemon",
			"2 small shallot cloves ",
			"2 cloves of garlic",
			"1 tablespoon Olive Oil",
			"1 teaspoon Red Wine Vinegar",
			"Dash of Worcestershire",
			"Salt & Pepper"
		],
		"instructions": "Add all ingredients to a blender and liquify. Taste and season as necessary."
	},
	{
		"slug": "mustard-dill-tortellini-salad-skewers",
		"title": "Mustard-Dill Tortellini Salad Skewers",
		"type": "salads",
		"about": "This is a recipe Jessica made for her baby shower with Ava. It ended up being the most popular dish there so we had to save the recipe.",
		"ingredients": [
			"1 (9oz) pkg refrigerated cheese tortellini",
			"1 (8oz) pkg frozen sugar snap peas",
			"68 (4 inch) wooden skewers",
			"1 pt. grape tomatoes, cut in half",
			"Mustard-Dill Vinaigrette - or Champagne Vinaigrette"
		],
		"instructions": "Cook tortellini according to package directions. Rinse under cold running water. ##Place sugar snap peas in a small bowl; cover with plastic wrap. Microwave at HIGH 2 minutes. Let stand, covered, 2 minutes. Rinse under cold running water. ##Thread each skewer with 1 sugar snap pea, 1 tortellini, and 1 tomato half. Place skewers in a 13- x 9-inch baking dish. ##Pour Mustard-Dill Vinaigrette over skewers, turning to coat. Cover and chill 4 hours. ##Transfer skewers to a serving platter; discard any remaining vinaigrette. *1 (12-oz.) bottle light Champagne vinaigrette may be substituted. For testing purposes only, we used Girard's Light Champagne Dressing."
	},
	{
		"slug": "edamame-black-bean-salad",
		"title": "Edamame Black Bean Salad",
		"type": "salads",
		"about": "This recipe came from Jessica's cousin Heather. It's a healthy dish that's easy to make and sounds delicious!",
		"ingredients": [
			"1 bag (12 oz) frozen shelled edamame",
			"1 can (15 oz) Progresso® black beans, drained, rinsed",
			"2 medium plum (Roma) tomatoes, chopped",
			"medium bell pepper, chopped (1 cup)",
			"4 medium green onions, sliced (1/4 cup)",
			"1/4 cup chopped fresh cilantro or flat-leaf parsley",
			"1/2 cup balsamic vinaigrette dressing",
			"1/4 teaspoon salt",
			"1/4 teaspoon cracked black pepper"
		],
		"instructions": "In 2-quart saucepan, cook edamame according to package directions; drain and rinse with cold water. ##In large bowl, toss edamame with remaining ingredients. ##Serve immediately or refrigerate until serving."
	},
	{
		"slug": "el-gaucho-caesar-salad",
		"title": "El Gaucho Caesar Salad",
		"type": "salads",
		"about": "Although this isn't technically a family recipe, El Gaucho has been a big part of both of our lives for a long time, and this recipe is one that we have each made countless times. It's a classic recipe that most people think is Italian, but its actually from Mexico. Caesar Gardini had a restaurant in Tijuana and he made this salad with 'everything he had' for one of his regular customers. The dish gained popularity, and due to the name Caesar, it became associated with Italian restaurants. At El Gaucho the Caesar is prepared tableside from scratch using premium fresh ingredients, and a coddled egg. It's prepared in a large wooden bowl with wooden tongs. Bowtie optional.",
		"ingredients": [
			"Fresh Romaine lettuce, washed & chopped",
			"~ 1/4 cup Extra Virgin Olive Oil",
			"1 tbsp chopped canned anchovies",
			"1-2 tsp minced garlic",
			"1 tbsp dijon mustard",
			"Garlic Croutons",
			"Juice from 1 lemon",
			"1-2 tsp Worcestershire Sauce",
			"Fresh ground black pepper",
			"Parmesan cheese",
			"1 egg, coddled"
		],
		"instructions": "Place egg in a dish of very hot water before you begin making the salad. This will kill any bacteria on the shell, making it safe to use the raw egg yolk in your dressing. ##In a large wooden salad bowl, add a good amount of fresh ground black pepper, minced garlic, and anchovies. If there is some liquid in the anchovies, add a teaspoon or two to the salad bowl. ##Using a fork (or two) start mashing these ingredients into the bowl and continue until a paste begins to form. Add the juice from one lemon (watch out for seeds), worcestershire and dijon mustard. Continue mixing and mashing in the bowl until you have a thick liquid. Add olive oil and egg yolk, continue mixing. ##Add lettuce, croutons, and Parmesan cheese, then toss. Be sure to toss well so that the lettuce is equally dressed. ##After plating, add more Parmesan cheese and ground pepper."
	}
]
