[
	{
		"slug": "chris-party-dip",
		"title": "Chris' Party Dip",
		"type": "side",
		"about": "This is one of Rick and Chris' neighborhood party dip recipes that originally came from their neighbor Melissa. It's easy to make, tastes great, and its an Iowa Football staple dish. It's great for parties because you can leave it warm in the crockpot all day.",
		"ingredients": [
			"2 1/2 cups cooked chicken (shredded)",
			"8 oz. cream cheese",
			"1 1/4 cups shredded medium cheddar cheese",
			"1/2 cup shredded mozzarella cheese",
			"1 cup Hidden Valley Ranch dressing (can be substituted with bleu cheese)",
			"1/2 cup hot sauce (I use Frank’s RedHot sauce)"
		],
		"instructions": "Put all ingredients into your crock pot, cover, and cook on low for an hour or so – until all the cheese is melted. ##Garnish with celery. May be served  with little bread rounds, crackers, tortilla chips...",
		"img": "http://pellegrinipage.com/recipes/img/ChrisPartyDip.jpg"
	},
	{
		"slug": "blue-cheese-scalloped-potatoes",
		"title": "Blue-Cheese Scalloped Potatoes",
		"type": "side",
		"about": "This recipe came from Uncle Jim and Aunt Brenda. This is one of their favorite side dishes.",
		"ingredients": [
			"3-Lbs. Potatoes (Yukon gold) if available",
			"1/2 tsp. Salt",
			"1/2 tsp. Pepper",
			"1 Tbs. Minced fresh Thyme",
			"1 Tbs. minced fresh rosemary",
			"1 Cup Crumbled Blue Cheese",
			"1 Cup Grated Parmesan (I used the 3 cheese Stella brand) Parmesan, Romano, asiago",
			"1 Cup Sour Cream",
			"2 Cups Whipping Cream (unwhipped)",
			"1/2 tsp. Salt"
		],
		"instructions": "Preheat oven to 350. Butter a 9 X 13-inch glass baking dish. ##Peel and slice the potatoes into 1/4-inch slices. Toss them in a large bowl with the salt, pepper, thyme and rosemary. ##Layer half of the potatoes in the buttered dish; sprinkle with half of the cheeses and top with remaining potatoes. ##In a bowl whisk together sour cream, whipping cream, and 1/2 tsp. of salt, then pour over potatoes. Tap the dish on the counter to spread out the sauce. ##Sprinkle with remaining cheeses. Bake potatoes for about 1 hour and 15 minutes, or until browned and tender. ##Allow to sit for 10 minutes before serving.",
		"img": ""
	},
	{
		"slug": "sweet-n-sour-green-beans",
		"title": "Sweet 'n Sour Green Beans",
		"type": "side",
		"about": "This is one of Uncle Jim and Aunt Brenda's favorite side dishes.",
		"ingredients": [
			"Green Beans (fresh or canned)",
			"6 - 8 strips of Bacon",
			"1 medium onion",
			"1/4 cup Apple Cider Vinegar",
			"1/2 cup sugar",
			"2 - 3 tablespoons of bacon drippings",
			"2 tablespoons cornstarch"
		],
		"instructions": "If using canned beans, drain them and set aside. Cook bacon, place on a paper towel to absorb grease, then cut into bite size pieces. ##Thinly slice the onion and saute in bacon drippings. Be sure to save bacon drippings when finished cooking the onion. ##Place green beans in a 13 x 9 pan, layer with the cooked onions, then add bacon pieces. ##To make the sweet 'n sour sauce, mix the apple cider vinegar, sugar, cornstarch, and 2 - 3 tablespoons of bacon drippings in a large bowl. Once mixed, pour sauce over green beans and bake at 350 degrees for 20 - 25 minutes.",
		"img": "http://pellegrinipage.com/recipes/img/sweet-sour-green-beans.jpg"
	},
	{
		"slug": "amys-bubble-bread",
		"title": "Amy's Bubble Bread",
		"type": "side",
		"about": "This dish was a family tradition for Jessica and Amy. You couldn't have Thanksgiving dinner without this bread, and it has become one of Jessica's favorite things to make. Here's the description of the dish, sent by Amy: That recipe came out of a signed cook book from the editor of the food page with the Minneapolis Tribune.  I worked with her daughter-in-law at the hospital.  I began making that bread even before Jessica was born and it was a favorite.  So as the story goes, it became a staple at most of our holiday gatherings.",
		"ingredients": [
			"1 loaf frozen bread dough",
			"1/4 cup melted butter",
			"1 egg, beaten",
			"1 tsp. parsley flakes",
			"1/4 tsp. salt",
			"1/2 tsp. garlic powder"
		],
		"instructions": "Let the bread dough thaw and rise, then cut up into silver dollar sizes pieces. ##Mix egg, parsley, salt and garlic powder into melted butter. Dip bread pieces into seasoned butter, then place in a greased loaf pan. ##Bake for 30 minutes at 375 degrees.",
		"img": "http://pellegrinipage.com/recipes/img/family8.jpg"
	},
	{
		"slug": "michaels-roasted-potatoes",
		"title": "Michael's Roasted Potatoes",
		"type": "side",
		"about": "These are the roasted potatoes that I make for approximately every other meal. It can be part of breakfast, lunch, or dinner depending on what you serve with it. When done right they come out golden, crispy, and delicious.",
		"ingredients": [
			"Red, Purple, or Fingerling potatoes",
			"olive oil",
			"salt & pepper",
			"cayenne pepper",
			"dried basil",
			"dried oregano",
			"garlic salt (or garlic powder)"
		],
		"instructions": "Dice potatoes into approximately 1/2 inch pieces. Spread out on a baking pan or sheet. I use a griddle pan so the potato pieces won't stick but any baking sheet will work. Tip: if you're not using a non-stick pan or sheet, be sure to spray the pan with non-stick cooking spray before adding the potatoes. ##Turn your broiler on high. Drizzle olive oil over the potatoes, then season with salt, black pepper, cayenne pepper, dried basil, dried oregano, and garlic salt. ##Mix the potato pieces, oil, and seasonings on the pan with your hands. The goal is for each side of each potato piece to have a light coating of oil and seasonings. ##Place potatoes about 6-8 inches under the broiler for ~12 minutes. Keep an eye on them and remove them once they turn golden brown. Texture should be crispy on the outside and soft on the inside. ##Let cool for ~2 minutes before serving."
	},
	{
		"slug": "quinoa-with-toasted-pine-nuts",
		"title": "Quinoa with Toasted Pine Nuts",
		"type": "side",
		"about": "This is a nice healthy side dish that was submitted by Jessica's cousin Heather.",
		"ingredients": [
			"1 cup uncooked quinoa",
			"2 teaspoons extra-virgin olive oil",
			"2 tablespoons finely chopped shallots",
			"1 tablespoon minced garlic",
			"1 1/4 cups unsalted chicken stock (such as Swanson)",
			"1/4 teaspoon kosher salt",
			"1/4 cup pine nuts",
			"1 tablespoon extra-virgin olive oil",
			"1/4 cup chopped fresh parsley",
			"2 tablespoons chopped fresh chives",
			"1/4 teaspoon freshly ground black pepper"
		],
		"instructions": "Rinse and drain quinoa. Heat a large saucepan over medium-high heat. Add 2 teaspoons extra-virgin olive oil to pan; swirl to coat. ##Add shallots; sauté 1 minute or until tender. Add minced garlic; cook 1 minute, stirring constantly. Add quinoa; cook 2 minutes, stirring frequently. ##Add chicken stock and kosher salt; bring to a boil. Cover, reduce heat, and simmer 13 minutes or until liquid is absorbed and quinoa is tender. ##While quinoa cooks, heat a large nonstick skillet over medium heat. Add pine nuts to pan; cook 3 minutes or until browned, stirring frequently. ##Combine quinoa mixture, pine nuts, 1 tablespoon extra-virgin olive oil, parsley, chives, and pepper; toss.",
		"img": "http://pellegrinipage.com/recipes/img/quinoa-toasted-pine-nuts.jpg"
	},
	{
		"slug": "nanas-scalloped-corn",
		"title": "Nana's Scalloped Corn",
		"type": "side",
		"about": "This is a dish that Nana made for so many family meals. Thank you to Jim and Brenda for supplying this recipe.",
		"ingredients": [
			"1 egg slightly beaten",
			"1 can cream corn",
			"1/2 cup milk",
			"1/2 cup breadcrumbs (I use Italian seasoned breadcrumbs)",
			"1/4 cup sliced onion",
			"1 tbsp butter"
		],
		"instructions": "Mix all ingredients in a loaf pan. ##Bake in oven at 350 degrees for 35 minutes.",
		"img": ""
	},
	{
		"slug": "sweet-potato-biscuits",
		"title": "Sweet Potato Biscuits",
		"type": "side",
		"about": "This is another recipe from Uncle Jim and Aunt Brenda",
		"ingredients": [
			"2 cups self-rising flour",
			"3 tbsp brown sugar",
			"1/4 tsp ground cinnamon",
			"1/8 tsp ground allspice",
			"1/4 cup butter",
			"3 tbsp shortening",
			"1 cup mashed sweet potatoes",
			"6 tbsp milk",
			"2 tbsp melted butter"
		],
		"instructions": "Combine flour, brown sugar, cinnamon, and allspice in a bowl. Cut in 1/4 cup butter and shortening with a pastry blender or forks until mixture is crumbly. Add mashed sweet potatoes and milk, stirring just until dry ingredients are moistened. ##Turn dough onto a floured surface and knead just a few times. Roll dough out to 1/2 inch thickness; cut with a 2-inch biscuit cutter. Place biscuits on an ungreased baking sheet and brush with melted butter. ##Bake at 400 degrees for 12 minutes, or until nicely browned. Makes about 15 - 18 biscuits.",
		"img": "http://pellegrinipage.com/recipes/img/sweet-potato-biscuits.jpg"
	},
	{
		"slug": "brendas-veggie-bars",
		"title": "Brenda's Veggie Bars",
		"type": "side",
		"about": "This is another recipe from Jim and Brenda.",
		"ingredients": [
			"2 tubes Pillsbury Crescent Rolls",
			"1/2 cup sour cream",
			"3/4 cup mayo",
			"2 - 8 oz cream cheese (I use the whipped)",
			"1 envelope ranch dressing",
			"3/4 cup chopped cauliflower",
			"3/4 cup chopped broccoli",
			"3/4 cup chopped peppers",
			"3/4 cup grated cheddar cheese"
		],
		"instructions": "Press Crescent roll dough into jelly roll pan for crust. Bake at 350 degrees for 8 minutes. Let cool. ##Combine next 4 ingredients. Combine sour cream, mayo, cream cheese, and ranch dressing. Spread on cooled crust. ##Combine chopped veggies and place on top. Press veggies into mixture, add cheddar cheese, and press again. ##Cover with saran wrap and refrigerate for several hours, or overnight. ##Cut into bars, serve, and enjoy!",
		"img": "http://pellegrinipage.com/recipes/img/Brenda8.jpg"
	},
	{
		"slug": "amys-spinach-dip",
		"title": "Amy's Spinach Dip",
		"type": "side",
		"about": "From Amy: This is a recipe that I used to make and take to parties or holiday events at other people's houses.",
		"ingredients": [
			"1 quart mayo",
			"1 cup sour cream",
			"1 c finely chopped fresh spinach",
			"1/4 c finely chopped, mined green onion-- tops and all",
			"1/2 bunch chopped fresh parsley",
			"1/4 t ground pepper",
			"1/4 t Accent spice",
			"dash of Tobasco",
			"dash of Worcestershire sauce"
		],
		"instructions": "Mix all ingredients and chill. ##Serve with bread, crackers or vegetables.",
		"img": "http://pellegrinipage.com/recipes/img/Amy1.jpg"
	},
	{
		"slug": "tex-mex-dip",
		"title": "Tex-Mex Dip",
		"type": "side",
		"about": "From Amy: This is another recipe that is good for parties and holidays as it makes a large portion. I make it on a large round platter or 12 inch pizza pan.  It has three layers.",
		"ingredients": [
			"Bottom layer",
			"2 cans of bean dip spread over surface",
			"Middle layer",
			"3 medium avocados- smashed- then add",
			"2 T lemon juice",
			"1/2 t salt",
			"1/4 t pepper",
			"Top layer",
			"3-5 green onions chopped",
			"3 tomatoes chopped",
			"8 oz shredded cheddar cheese",
			"Tortilla chips"
		],
		"instructions": "Mix and spread all middle layer ingredients over the bean dip layer, then mix and spread all top layer ingredients. ##Chill and serve with tortilla chips.",
		"img": "http://pellegrinipage.com/recipes/img/tex-mex-dip.jpg"
	},
	{
		"slug": "amys-party-potatoes",
		"title": "Amy's Party Potatoes",
		"type": "side",
		"about": "From Amy: This is a recipe that came to me from another RN at the hospital.  It can be altered with several different ingredients and I used to make this at the holidays.  Just like Bubble Bread this became a tradition of sorts.",
		"ingredients": [
			"8-10 peeled potatoes",
			"8 oz cream cheese",
			"1 c sour cream",
			"1/2 c butter",
			"Light garlic salt"
		],
		"instructions": "Cook and drain potatoes, then mash with cream cheese and sour cream. ##Once blended, add butter and garlic salt. ##Spoon into an oven proof dish and bake for 30 minutes at 350 degrees.",
		"img": ""
	},
	{
		"slug": "amys-cheese-ball",
		"title": "Amy's Cheese Ball",
		"type": "side",
		"about": "From Amy: I call any cheese and sour cream my two favorite food groups so this recipe is one that I like and used to make for parties and holidays.",
		"ingredients": [
			"7 oz sharp cheddar cheese, shredded",
			"8 oz cream cheese, softened",
			"1- 4 1/2 oz can of deviled ham",
			"1/2 cup ripe black olives",
			"1/2 cup finely chopped pecans"
		],
		"instructions": "Beat cheeses till blended.  Beat in deviled ham, stir in olives and shape into a ball then roll the ball in the pecans. ##Chill until semi firm and serve with crackers.",
		"img": ""
	},
	{
		"slug": "cheddar-cheese-potatoes",
		"title": "Cheddar Cheese Potatoes",
		"type": "side",
		"about": "This recipe came from Amy. Its a quick and easy side dish that you can serve at just about any meal.",
		"ingredients": [
			"2 lbs frozen hash browns, thawed",
			"1 can cream of mushroom soup",
			"1 can cream of onion soup",
			"1 pint sour cream",
			"2 cups shredded cheddar cheese"
		],
		"instructions": "Mix everything except cheese and place in 9 x 13 dish.  Sprinkle with cheese and bake at 350 for 30 minutes covered and an additional 30 uncovered.",
		"img": ""
	},
	{
		"slug": "amys-spinach-artichoke-dip",
		"title": "Amy's Spinach Artichoke Dip",
		"type": "side",
		"about": "This is one of Amy's favorite dips for parties and get-togethers.",
		"ingredients": [
			"2 c mozzarella cheese, divided",
			"1/2 c sour cream",
			"1/4 c grated Parmesan cheese, divided",
			"1/4 t black pepper",
			"2 cloves garlic, crushed",
			"1 14 oz can or artichoke hearts, drained and chopped",
			"1 8 oz cream cheese, softened",
			"1/2 10 oz frozen chopped spinach, thawed, drained and squeezed dry--I use the whole package and and also add water chestnuts"
		],
		"instructions": "Preheat oven to 350 degrees. Combine 1 and 1/2 c mozzarella, sour cream, 2 T Parm and the next 6 ingredients in a large bowl and stir until well blended. ##Spoon into a 1 1/2 qt baking dish. Sprinkle with 1/2 c mozzarella and 2 T parm on top. ##Bake at 350 for 30 minutes, or until bubble and brown. ##Serve with crackers or chips.",
		"img": "http://pellegrinipage.com/recipes/img/spinach-artichoke-dip.jpg"
	},
	{
		"slug": "chocolate-zucchini-bread",
		"title": "Chocolate Zucchini Bread",
		"type": "side",
		"about": "From Amy: 'This recipe came from a home care nurse that I worked with years ago. She was always bringing in treats for us to enjoy.'",
		"ingredients": [
			"3 eggs",
			"2 c sugar",
			"1 c vegetable oil",
			"4 T cocoa",
			"1 t vanilla",
			"2 c grated zucchini",
			"2 c flour",
			"1 t salt",
			"1 t cinnamon",
			"1 t baking soda",
			"1/4 t baking powder"
		],
		"instructions": "Cream together 3 eggs, 2 cups sugar, and 1 cup vegetable oil. ##Add cocoa, vanilla, and grated zucchini, and mix well. ##Add flour, salt, cinnamon, baking soda, and baking powder. ##Place in 2 greased and floured loaf pans and bake for 1 hour at 350.",
		"img": ""
	}
]
