[
	{
		"slug": "cioppino",
		"title": "Cioppino",
		"type": "soup",
		"about": "This seafood stew (pronounced 'Cho-Pee-No'), which normally features fresh shellfish, a tomato-based broth, and French bread, originated in San Francisco in the mid 20th century. My Dad Elmer considered this dish his specialty, and it was easily my favorite meal he made. Although this isn't his personal recipe, it's pretty close and definitely does the dish justice.",
		"ingredients": [
			"3 tablespoons of olive oil",
			"1 large fennel bulb, thinly sliced",
			"1 onion, chopped",
			"3 large shallots, chopped",
			"2 teaspoons of salt",
			"4 large garlic cloves, finely chopped",
			"1 teaspoon crushed red pepper",
			"1/4 cup of tomato paste",
			"2 large cans of diced tomatoes",
			"1 bottle of dry white wine",
			"5 cups of fish stock",
			"1 bay leaf",
			"1 pound of manilla clams, scrubbed",
			"1 pound of mussels, scrubbed, debearded",
			"1 pound of uncooked, jumbo shrimp, peeled and deveined",
			"1.5 pounds of halibut or sea bass",
			"1 pound of dungeness crab meat"
		],
		"instructions": "Heat the oil in a very large pot over medium heat. Add the fennel, onion, shallots, and salt and saute until the onion is translucent, about 10 minutes. ##Add the garlic and 3/4 teaspoon of red pepper flakes, and saute 2 minutes. Stir in the tomato paste. Add tomatoes with their juices, wine, fish stock and bay leaf. Cover and bring to a simmer. Reduce the heat to medium-low. Cover and simmer until the flavors blend, about 30 minutes. ##Add the clams and mussels to the cooking liquid. Cover and cook until the clams and mussels begin to open, about 5 minutes. Add the shrimp and fish. ##Simmer gently until the fish and shrimp are just cooked through, and the clams are completely open, stirring gently, about 5 minutes longer (discard any clams and mussels that do not open). ##Season the soup, to taste, with more salt and red pepper flakes. Ladle the soup into bowls and serve.",
		"img": "http://pellegrinipage.com/recipes/img/cioppino.jpg"
	},
	{
		"slug": "jessicas-chicken-taco-chili",
		"title": "Jessica's Chicken Taco Chili",
		"type": "soup",
		"about": "This was a recipe that Jessica originally got from her cousin Lauren. Its a great hearty dish that she has made several times and everyone always enjoys it. It's a crockpot dish so it takes a while to cook, but if you like chili and Mexican food, this one is a no-brainer!",
		"ingredients": [
			"1 white onion, chopped finely",
			"1 (16 oz.) can chili beans",
			"1 (15 oz.) can black beans, drained and rinsed",
			"1 (15 oz.) can whole kernel corn, drained",
			"1 (8 oz.) can tomato sauce",
			"2 (10 oz.) cans diced tomatoes with green chiles",
			"1 (1.25 oz.) package taco seasoning",
			"3 whole skinless, boneless, chicken breasts, thawed or frozen"
		],
		"instructions": "Stir onion, beans, corn, tomato sauce, dice tomatoes, and taco sauce into a slow cooker. Sautee the onion before to make sure that they are not crunchy. Lay the chicken breast on top of the mixture, pressing down slightly so that it gets covered by other ingredients. ##Set slow cooker to low heat, cover, and cook for 3-4 hours on low if your chicken is thawed. May take 4-5 hours on low if your chicken is frozen. ##Remove chicken breasts from the chili and shred. A good tip for shredding cooked chicken is to place it in a bowl and use a powered hand mixer. It shreds perfectly evenly. Stir shredded chicken back into the soup. ##You're technically supposed to cook it on low for another 2 hours in the crockpot but its not really necessary. It's a very forgiving dish that can go about as long as you want it to. Top with shredded cheese, sour cream, and crushed tortilla chips.",
		"img": "http://pellegrinipage.com/recipes/img/chicken-taco-chili.jpg"
	},
	{
		"slug": "chicken-enchilada-soup",
		"title": "Chicken Enchilada Soup",
		"type": "soup",
		"about": "This is a great slow-cooking soup that was submitted by Uncle Jim and Aunt Brenda. Super easy to make and perfect for lazy Sundays.",
		"ingredients": [
			"1 lb. Skinless Boneless Chicken Breast 5 Tenderloins",
			"1- Jar Trader Joe's corn & Chile tomato less salsa 13.75 oz.",
			"1- 14.5 oz. can Safeway fire roasted diced tomatoes including juice",
			"1.5 cans chicken broth",
			"1- 10 oz. can Enchilada Sauce",
			"1- 4 oz. can Green Chilies",
			"1/2 white onion, chopped",
			"1/4 to 1/2 cup chopped celery",
			"2 bay leaves (remove before serving)",
			"3- cloves garlic",
			"1 teaspoon Ground Cumin",
			"1 teaspoon Chili Powder",
			"1/2 teaspoon salt",
			"1-can Mexican Black Beans Drained (optional)"
		],
		"instructions": "Rinse and pat dry chicken breast, then place in bottom of oiled slow cooker. Add all other mixed ingredients. ##Cook on low for 6 hours. Transfer chicken to large plate and shred the meat with 2 forks. Remove bay leaves and add black beans. Return chicken to slow cooker and continue cooking for additional 30 - 60 minutes. ##Garnish with sour cream, wedge of lime, avocado, cilantro, and tortilla strips.",
		"img": "http://pellegrinipage.com/recipes/img/chicken-enchilada-soup.jpg"
	},
	{
		"slug": "loaded-potato-soup",
		"title": "Loaded Potato Soup",
		"type": "soup",
		"about": "This is a recipe that Jessica found online. We made it once and thought it was great. Here's the description it came with: \"Such a simple and tasty soup that really fills you up! We loved the spin on regular potato soup... adding bacon, sour cream, cheese and chives to make it like the oh so yummy loaded baked potato! Served with cornbread, this was SUCH a yummy meal! We hope you guys enjoy this recipe as much as we did, especially with that crisp fall air we seem to be seeing more and more of!\"",
		"ingredients": [
			"6 large potatoes, peeled and cubed",
			"1 large onion, diced",
			"1 quart chicken broth",
			"3 garlic cloves, minced",
			"1/4 cup butter",
			"Salt to taste",
			"Pepper to taste",
			"1 cup cream or 1 cup 1/2 and 1/2 cream",
			"1 cup shredded sharp cheddar cheese"
		],
		"instructions": "Combine first 7 ingredients in a large slow cooker and cook on high for 4 hours or low for 8 hours (potatoes should be tender). Then you will need to mash potatoes until coarsely chopped and soup is slightly thickened. ##Stir in cream and cheese. Garnish with cives, sour cream, bacon, and cheeses. Simple and delicious!",
		"img": "http://pellegrinipage.com/recipes/img/potato-soup.jpg"
	},
	{
		"slug": "ricks-lobster-corn-chowder",
		"title": "Rick's Lobster Corn Chowder",
		"type": "soup",
		"about": "This is probably my favorite of Rick's dishes. I remember having it at his house in Iowa for Christmas, 2008. It's a delicious chowder that any seafood (or corn) fan will love. Highly recommended.",
		"ingredients": [
			"1/4 lb. slab bacon (rind removed)",
			"1 tbsp unsalted butter",
			"2 cups diced onion",
			"2 tbsp all-purpose flour",
			"4 cups chicken broth",
			"2 bay leaves",
			"2 Russet potatoes, pealed and cut into 1/4 inch dice",
			"1 tsp sweet paprika",
			"3 sprigs fresh thyme",
			"1 cup half-and-half",
			"3 cups cooked fresh corn kernels",
			"1 red or yellow bell pepper, diced",
			"salt & black pepper to taste",
			"4 scallions, very thinly sliced",
			"2 cups cooked lobster (fresh or frozen), cut into 1/2 inch dice",
			"1/4 cup parsley"
		],
		"instructions": "Cut bacon into small dice and place in a large pot over low heat. Cook, stirring to render the fat, for 5 to 7 minutes. Add butter and let it melt. Add onion and cook over low heat, stirring occasionally, until wilted (about 10 minutes). ##Add flour, cook and continue to stir for 1 minute. Simmer broth, bay leaves, and paprika in the pot for 5 minutes to flavor the broth. Add potatoes and thyme; cook until potatoes are just tender, about 15 minutes. Add half-and-half, corn, peppers, and scallions; cook 10 minutes. ##Season with salt and pepper Add lobster and parsley just before serving hot. Serves 8.",
		"img": "http://pellegrinipage.com/recipes/img/rick2.jpg"
	},
	{
		"slug": "michaels-meat-lovers-chili",
		"title": "Michael's Meat Lovers Chili",
		"type": "soup",
		"about": "I call this one the Vegan Nightmare. Disclaimer** If you don't like tender, slow-cooked meats, then this isn't the dish for you. I first made this on a Football Sunday at home and was very pleased with it. I don't cook with recipes so everything I'm putting here is an approximation. Like Gigi always said, 'You cook with what you have.' Feel free to substitute meats, or any other ingredients. Hope you enjoy!",
		"ingredients": [
			"2 - 3 beef ribs",
			"2 lbs beef stew meat",
			"1 lb ground turkey",
			"2 pork chops",
			"4 Italian sausages",
			"1 large can pinto beans",
			"1 can kidney beans",
			"1 large can diced tomatoes",
			"1 can tomato sauce",
			"2 cups beef broth",
			"2 rosemary sprigs",
			"4 cloves peeled garlic, minced",
			"1/4 cup lemon juice",
			"1 tbsp dried basil",
			"1 tbsp dried oregano",
			"2 tbsp chili powder",
			"1 tbsp cayenne pepper",
			"2 tbsp salt (fresh ground is best)",
			"2 tbsp black pepper (fresh ground is best)",
			"1 tbsp Worcestershire sauce",
			"1/2 tsp ground cumin",
			"1 large onion, chopped",
			"Sliced Crimini mushrooms",
			"cheddar cheese",
			"sour cream",
			"green onion, chopped"
		],
		"instructions": "Combine all ingredients in either a crock pot, or in a stew pot on the stove top. If you're using a crock pot, set the temperature to high. If you're using the stove top, set the burner temperature to ~3. Let cook for ~6 hours, stirring occasionally. If boiling occurs, lower the temperature accordingly. ##Before serving, remove rib bones, and slice the large pieces of meat into small pieces. Stir everything back in, remove the rosemary sprigs, and serve. ##Garnish with cheddar cheese, sour cream, and chopped green onion.",
		"img": "http://pellegrinipage.com/recipes/img/meat-lovers-chili.jpg"
	},
	{
		"slug": "elmers-brisket-soup",
		"title": "Elmer's Brisket Soup",
		"type": "soup",
		"about": "This is one of the dishes that I associate with my childhood. My Dad made this soup regularly, and although I wasn't very big on brisket as a child, I always loved the soup. From my Mom: 'Another dish that was one of Michael’s dads favorite was Italian soup. It can be made with any type of meat but we mostly used brisket of beef. About a pound of brisket, sliced to serving size pieces and browned in olive oil with minced garlic and onions.'",
		"ingredients": [
			"1 lb. brisket",
			"olive oil",
			"1 onion, minced",
			"Fresh minced garlic",
			"2-3 celery stalks, cut into 3 inch pieces",
			"2-3 carrots, peeled and cut into 3 inch pieces",
			"Handful of celery leaves, minced",
			"Handful of fresh Italian parsley, minced",
			"1 can Hunts whole tomatoes",
			"Salt & Pepper to taste",
			"Small Seashell pasta",
			"Parmesan cheese"
		],
		"instructions": "Slice the brisket into serving size pieces and brown in a pan with olive oil, minced garlic, and minced onion. In a large soup pot or crock pot, add meat, garlic, onion, celery leaves, parsley, salt and pepper. ##Add 1 can of Hunts whole tomatoes, break up tomatoes in to smaller pieces, fill with water, cover and simmer until meat is tender. ##Add carrots about an hour before the meat is done and celery stalks the last 30 minutes. ##Remove meat and vegetables to serve as side dish and add small seashell pasta to broth for soup. Cook until pasta is al dente.  ##Serve soup with lots of parmesan cheese on top.",
		"img": "http://pellegrinipage.com/recipes/img/Dad1.jpg"
	},
	{
		"slug": "jims-black-bean-turkey-chili",
		"title": "Jim's Black Bean Turkey Chili",
		"type": "soup",
		"about": "This is one of Uncle Jim and Aunt Brenda's favorites. Considering my love for chili and turkey, I'm going to have to make this one very soon.",
		"ingredients": [
			"1.5 lbs ground turkey",
			"1 tbsp olive oil",
			"1 cup diced red onion",
			"2 cups diced bell pepper",
			"2 tsp minced garlic",
			"1.5 tsp chili powder",
			"1.5 tsp dried oregano",
			"1.5 tsp ground cumin",
			"1/2 tsp red pepper flakes",
			"2 cups ripe tomatoes, chopped",
			"14 oz can low sodium tomato sauce",
			"1 cup low sodium chicken broth",
			"1 tbsp red wine vinegar",
			"1 - 30 oz can black beans, drained",
			"Avocado (optional garnish)",
			"Sour Cream (optional garnish)",
			"Grated Cheddar Cheese (optional garnish)",
			"Cornbread (optional side)"
		],
		"instructions": "Saute ground turkey in a large non-stick skillet over medium heat until lightly browned; remove from heat and set aside. ##Heat olive oil in a soup pot, add onions and peppers, and saute until soft. Add garlic and seasonings and saute about 2 minutes. ##Stir in remaining ingredients and turkey; simmer for at least 30 minutes. ##Garnish options: chopped avocado, sour cream, or grated cheddar cheese. Serve with cornbread.",
		"img": "http://pellegrinipage.com/recipes/img/Jim1.jpg"
	}
]
